{"linkinbio_posts":[{"id":38165191,"caption":"A hungry black bear interrupted a family picnic in the north of Mexico on Monday, devouring a whole bunch of enchiladas and tacos. In the video, a woman can be seen covering a child’s face while the black bear feasts on the banquet and calmly descends from the picnic table after it’s finished.","created_time":1695938398,"high_res_url":"https://image-cdn.later.com/t/linkinbio/b20e58f32c9fbb-LIB38165191.jpg?width=960&t=1695938398&sig=7751548ddabe788b30e391fc85ea3307ef6d75f9b6f9b4589e368bec43e603c0","image_url":"https://image-cdn.later.com/linkinbio/b20e58f32c9fbb-LIB38165191.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/b20e58f32c9fbb-LIB38165191.jpg?width=320&height=320&t=1695938398&sig=45a41c745fc76dadbc5bdc37398f4e5c62ab7abfffdd691c046ff5331bd73c7a","link_url":"https://globalnews.ca/news/9989149/black-bear-mexico-birthday-picnic-video/?utm_campaign=later-linkinbio-globalnews&utm_content=later-38165191&utm_medium=social&utm_source=linkin.bio","media_id":"18058328719457648","media_type":"video","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/b20e58f32c9fbb-LIB38165191.jpg?width=240&height=240&t=1695938398&sig=83452fc8cf531c466ca329cf39acd4575d8910bb4a79e1c149e8667e09c1165c","network_type":"instagram","post_id":310476189,"post_type":"reel","posted_time":1695938784,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":38158233,"caption":"Michael Gambon, the prestigious stage and film actor best known for playing the wise wizard Albus Dumbledore in Harry Potter, has died. He was 82.⁠\n⁠\nIn a statement released Thursday, Gambon’s wife, Lady Anne Gambon, and his son, Fergus, said the actor died “peacefully.”⁠\n⁠\n“We are devastated to announce the loss of Sir Michael Gambon,” the statement reads. “Beloved husband and father, Michael died peacefully in hospital with his wife Anne and son Fergus at his bedside, following a bout of pneumonia.”⁠\n⁠\nThe family has asked for privacy during this “painful time,” and thanked Gambon’s admirers for their loving messages.⁠\n⁠\nGambon was born in Dublin, Ireland, in 1940. He moved to London as a child and went on to apprentice as a toolmaker before attending the Royal Academy of Dramatic Art.⁠\n⁠\nBefore donning a long, white beard to play Dumbledore for the first time in 2004’s Harry Potter and the Prisoner of Azkaban, Gambon already had an esteemed stage, TV and film career.⁠\n⁠\nGambon was tapped to take over the role of the Hogwarts’ headmaster in 2004 following the death of Richard Harris in October 2002. Harris played Dumbledore in the first two films in the Harry Potter franchise.⁠\n⁠\nThroughout his lifetime, Gambon was nominated for two Emmy Awards and won four BAFTA Awards, two Olivier Awards and a SAG Award for outstanding cast performance in The King’s Speech. ⁠\n⁠\nHe was appointed Commander of the Order of the British Empire in 1990.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Global News","created_time":1695922498,"high_res_url":"https://image-cdn.later.com/t/linkinbio/c07826b6c4eab5-LIB38158233.jpg?width=960&t=1695922498&sig=bd0a419dc39731ef8186dbc787b3f55e7c524ebb21a012fe061b99be5dd3be3c","image_url":"https://image-cdn.later.com/linkinbio/c07826b6c4eab5-LIB38158233.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/c07826b6c4eab5-LIB38158233.jpg?width=320&height=320&t=1695922498&sig=db547961b97bf02f0e7b6d74e36c354cbcbbc21a121d554ef9a2b784f60ac63c","link_url":"https://globalnews.ca/news/9991426/michael-gambon-dumbledore-harry-potter-dies-82/?utm_campaign=later-linkinbio-globalnews&utm_content=later-38158233&utm_medium=social&utm_source=linkin.bio","media_id":"17981370149440305","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/c07826b6c4eab5-LIB38158233.jpg?width=240&height=240&t=1695922498&sig=63a420a02c27ca004b7ee0f58e38b075a8465fd4abdd98ac2fea9beffa6e087b","network_type":"instagram","post_id":310440889,"post_type":"feed","posted_time":1695922514,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":38153194,"caption":"President Joe Biden’s dog, Commander, can’t seem to keep his mouth to himself.⁠\n⁠\nFor the 11th time, the adolescent German Shepherd has bit someone — this time a U.S. Secret Service agent.⁠\n⁠\nIn July, White House officials said the first family was working with new training and leash protocols to help the reactive animal.⁠\n⁠\nResponding to this most recent bite, Elizabeth Alexander, the communications director for the first lady, Jill Biden, told The Guardian: “The White House can be a stressful environment for family pets, and the first family continues to work on ways to help Commander handle the often unpredictable nature of the White House grounds.”⁠\n⁠\nShe said the Bidens are “incredibly grateful to the Secret Service and executive residence staff for all they do to keep them, their family, and the country safe.”⁠\n⁠\nEarlier in Biden’s tenure, another of his dogs, Major, was involved in biting incidents at the White House and was moved out to live with family friends in Delaware. Commander filled his place in 2021.⁠\n⁠\nCommander’s most serious incident happened in November of last year, when an officer had to be hospitalized after the dog clamped down on their arms and thighs.⁠\n⁠\nEmails exchanged between Secret Service officials and agents, obtained through Freedom of Information Act requests by the conservative group Judicial Watch this past July, show a contempt for the first dog.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Madel Ngan / Getty Images","created_time":1695912848,"high_res_url":"https://image-cdn.later.com/t/linkinbio/c276fc8429bd58-LIB38153194.jpg?width=960&t=1695912848&sig=a3b7e7818d1dd141dd051f399d071fdc9e740fcf0eee27847b0abb8760363278","image_url":"https://image-cdn.later.com/linkinbio/c276fc8429bd58-LIB38153194.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/c276fc8429bd58-LIB38153194.jpg?width=320&height=320&t=1695912848&sig=720b60c76103f064b80f99429e93ae71acdf191edbf8483ef3f4e8928a0868b8","link_url":"https://globalnews.ca/news/9989851/joe-biden-dog-commander-11-bites/?utm_campaign=later-linkinbio-globalnews&utm_content=later-38153194&utm_medium=social&utm_source=linkin.bio","media_id":"17996317940491910","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/c276fc8429bd58-LIB38153194.jpg?width=240&height=240&t=1695912848&sig=a47e985dc9c5a1cbd62a9352349536f1b6aaabd8e4494c389ff90e24c0ef8106","network_type":"instagram","post_id":310416575,"post_type":"feed","posted_time":1695912876,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":38109109,"caption":"Actor David McCallum, who became a teen heartthrob in the hit series The Man From U.N.C.L.E. in the 1960s and reached new audiences playing the beloved character of Dr. Donald (Ducky) Mallard in NCIS, has died at age 90.⁠\n⁠\nMcCallum died Monday of natural causes while surrounded by his family at the New York Presbyterian Hospital, according to a statement from CBS. He had just celebrated his 90th birthday less than a week ago on Sept. 19.⁠\n⁠\nMcCallum was the last original cast member on CBS’s NCIS, in which he played a bookish medical examiner for the Naval Criminal Investigation Service. The fan-favourite character of Ducky was introduced during the show’s launch in 2003 and appeared right through to the 20th season finale in May 2023.⁠\n⁠\nIn recent years, the actor had taken on a lighter shooting schedule for NCIS so he could spend time with his wife of 56 years, Katherine Carpenter, his children, grandchildren and cat, Nickie.⁠\n⁠\nScottish-born McCallum became a household name in the mid-’60s playing agent Illya Kuryakin in The Man from U.N.C.L.E, a TV series that rode the wave of spy thrillers that came out after the success of the James Bond films.⁠\n⁠\nMcCallum’s enigmatic, intellectual character on the show was particularly popular with teenage girls at the time — no doubt helped by the actor’s good looks and Beatlesque haircut. He and his co-star Robert Vaughn, who played main character Napoleon Solo, were often mobbed by young fans during personal appearances.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: CP Images","created_time":1695766042,"high_res_url":"https://image-cdn.later.com/t/linkinbio/44a7463b44c763-LIB38109109.jpg?width=960&t=1695766042&sig=5a157ed87c77e8a383947122c296e7f581502ff9bec6317218b5eee4f25de6db","image_url":"https://image-cdn.later.com/linkinbio/44a7463b44c763-LIB38109109.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/44a7463b44c763-LIB38109109.jpg?width=320&height=320&t=1695766042&sig=7784ff97773781ace8a2fe663f7f267db73d11ade7e50c9328a233c09f6fca6b","link_url":"https://globalnews.ca/news/9985680/david-mccallum-dead-ncis-ducky/?utm_campaign=later-linkinbio-globalnews&utm_content=later-38109109&utm_medium=social&utm_source=linkin.bio","media_id":"17855926065037584","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/44a7463b44c763-LIB38109109.jpg?width=240&height=240&t=1695766042&sig=9b6a0592f71e51f9a49cbdac1c77b74d9cee1f32a5c510b796409cf862ddec4f","network_type":"instagram","post_id":310199258,"post_type":"feed","posted_time":1695766214,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":38107449,"caption":"Gymnastics Ireland has condemned racism and apologized after one of its judges appeared to snub a young Black gymnast at a medal ceremony last year.⁠\n⁠\nVideo of the incident resurfaced this weekend and again went viral on social media, racking up millions of views.⁠\n⁠\nIn the clip from March 2022, a group of young girls stand single file in their shiny gym suits to receive participation medals inside Dublin’s National Indoor Arena. ⁠\n⁠\nAs a judge from the competition distributes the prizes, she skips the only Black gymnast in line. Several of the girls appear momentarily confused as they pose for photos and wave at their parents, all the while the Black gymnast remains without a medal.⁠\n⁠\nOn Monday, Gymnastics Ireland released a statement of apology to the girl and her family. Though the family has remained unnamed publicly, the girl’s mother told several media outlets the behaviour of Gymnastics Ireland — and the untimeliness of its regret — is unacceptable.⁠\n⁠\nEighteen months after the original incident, and after the family filed a complaint with the Gymnastics Ethics Foundation in Switzerland, Gymnastic Ireland “unreservedly” apologized on Sunday. The apology was shared publicly the following day.⁠\n⁠\nThe body promised “nothing like this will happen again.” It said an independent expert will review the organization’s policies and procedures this year.⁠\n⁠\nThe young gymnast’s mother told The Guardian that despite arranging mediation between the family and the judge who handed out the medals, a representative from Gymnastics Ireland did not attend the meeting. The family said the decision not to attend the mediation wrongfully painted the incident as a personal dispute between them and the judge.⁠\n⁠\nGymnastics Ireland told The Guardian the organization “went to great lengths over the extended period to encourage participation in the mediation by both parties.” The body said it only recently “became aware that the family had expected an official representative from GI to be present at the mediation.”⁠\n⁠\nClick the link in the @GlobalNews bio to read more.","created_time":1695761388,"high_res_url":"https://image-cdn.later.com/t/linkinbio/7682d086f57a49-LIB38107449.jpg?width=960&t=1695761388&sig=303cc2c05ba502e4a832a22f6ec5c5bbd89d26c91e8c044f409759561ea8c947","image_url":"https://image-cdn.later.com/linkinbio/7682d086f57a49-LIB38107449.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/7682d086f57a49-LIB38107449.jpg?width=320&height=320&t=1695761388&sig=a8ee3ad4ba67889033fc486b40b5af05bc44c52540915be897f52c8638f52aef","link_url":"https://globalnews.ca/news/9983110/gymnastics-ireland-apology-black-gymnast-denied-medal/?utm_campaign=later-linkinbio-globalnews&utm_content=later-38107449&utm_medium=social&utm_source=linkin.bio","media_id":"17904346466779511","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/7682d086f57a49-LIB38107449.jpg?width=240&height=240&t=1695761388&sig=a5bf3c0cb7745aa6d8ea3393976db4c3e07ce151caf4732a55ea16503f767e54","network_type":"instagram","post_id":310190370,"post_type":"feed","posted_time":1695761416,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":38081163,"caption":"House of Commons Speaker Anthony Rota apologized again Monday for last week inviting and paying tribute to a Ukrainian Second World War veteran who fought for Nazi Germany.⁠\n⁠\nThe tribute happened on Friday when Volodymyr Zelenskyy, Ukraine’s president who is also Jewish, was in Ottawa for his first official visit since Russia’s full-scale invasion of Ukraine on Feb. 24, 2022.⁠\n⁠\nRota, who said he regretted his decision and was “deeply sorry” for any hurt he caused, is facing calls from the NDP and the Bloc Québécois to resign as Speaker.⁠\n⁠\n“My intention was to show that the conflict between Russia and Ukraine is not a new one; that Ukrainians have unfortunately been subject to foreign aggression for far too long and that this must end,” he said.⁠\n⁠\n“I have subsequently become aware of more information which causes me to regret my decision to recognize this individual. I wish to apologize to the House. I am deeply sorry that I have offended many with my gesture and remarks.”⁠\n⁠\nDuring Zelenskyy’s visit to the House of Commons, he joined MPs and the Ukrainian delegation during two separate standing ovations for 98-year-old Yaroslav Hunka.⁠\n⁠\nRota said he invited Hunka to the House of Commons, and that he was a constituent of his Ontario riding, Nipissing-Timiskaming. He described Hunka as a veteran who fought for “Ukrainian independence against the Russians.”⁠\n⁠\n“He is a Ukrainian hero, a Canadian hero, and we thank him for all his service,” Rota said.⁠\n⁠\nThe Friends of Simon Wiesenthal Center for Holocaust Studies said in a statement that Hunka served in the 14th Waffen Grenadier Division of the SS, also known as the First Ukrainian Division, and demanded an apology.⁠\n⁠\nRota issued a written apology on Sunday, and delivered another at the start of House of Commons proceedings Monday — but that was not enough for the NDP, which is demanding his resignation as Speaker.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n","created_time":1695679083,"high_res_url":"https://image-cdn.later.com/t/linkinbio/302aad6d1413ad-LIB38081163.jpg?width=960&t=1695679083&sig=1fba9fc969a805f362822539d634980c8dd2dfcca8f4839af82c8d34b2a05998","image_url":"https://image-cdn.later.com/linkinbio/302aad6d1413ad-LIB38081163.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/302aad6d1413ad-LIB38081163.jpg?width=320&height=320&t=1695679083&sig=ba8307e5a4e518347af5cb1f4989af524b972662de0d8246bd33dc33265da750","link_url":"https://globalnews.ca/news/9983103/anthony-rota-ukraine-nazi-unit-apology/?utm_campaign=later-linkinbio-globalnews&utm_content=later-38081163&utm_medium=social&utm_source=linkin.bio","media_id":"17954282867534088","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/302aad6d1413ad-LIB38081163.jpg?width=240&height=240&t=1695679083&sig=d97ea551165a7207930be8c1ac5fc8d9d3607f326b2ea256dcee9b903c4bd761","network_type":"instagram","post_id":310055527,"post_type":"feed","posted_time":1695679245,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":38049514,"caption":"Since filing her lawsuit against the Church of Scientology last month, Leah Remini has accused the organization of retaliating against her with a campaign of “continued, aggressive harassment.”⁠\n⁠\nRemini, 53, sued the church and its leader David Miscavige in August for harassment, stalking, defamation and a myriad of other alleged illegal activities. She accused Scientology of using “mob-style operations and attacks” to harass her since she defected from the faith in 2013.⁠\n⁠\nRemini has since amended her lawsuit in Los Angeles County Superior Court and claimed the harassment against her has “escalated to a much greater degree than ever before,” according to Deadline, which shared the revised complaint.⁠\n⁠\nScientology has not yet responded publicly to Remini’s new allegations. The organization previously called the lawsuit “pure lunacy” and accused Remini of “spreading falsehoods and hate speech.”⁠\n⁠\n“Remini’s complaints are like an anti-Semite complaining about the Jewish Anti-Defamation League for exposing the anti-Semite’s bigotry and propaganda,” the Church wrote. “The Church is not intimidated by Remini’s latest act of blatant harassment and attempt to prevent truthful free speech. If Remini does not believe in free speech, then she should consider emigrating to Russia.”⁠\n⁠\n“Since the filing of my lawsuit, these attacks have escalated dramatically and have now more than ever focused not only on me, but my family members, my friends and professional colleagues,” Remini wrote in her amendment, according to NBC News. “To date, my requests have been dismissed as these abuses continue on a daily basis.”⁠\n⁠\nRemini claimed that since filing the lawsuit against Scientology, “potential fraud” has been flagged on several of her credit cards. The instance of fraud is allegedly “significantly higher” than any fraud previously witnessed by Remini’s financial manager. ⁠\n⁠\nA tutor hired by Remini — who said they’ve separately been targeted by Scientology promotions — was also hacked, resulting in an apparent US$15,000 (over C$21,100) loss to their business.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Michael Tran/Getty Images","created_time":1695560806,"high_res_url":"https://image-cdn.later.com/t/linkinbio/5e2146a30f9920-LIB38049514.jpg?width=960&t=1695560806&sig=c5c01480085fac728270762506ebef006eb9d490f4f1b0841819081e375a3291","image_url":"https://image-cdn.later.com/linkinbio/5e2146a30f9920-LIB38049514.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/5e2146a30f9920-LIB38049514.jpg?width=320&height=320&t=1695560806&sig=ba5f02155908f7c128757a8133683c4243210c3f3d6250cbfd821b213c457845","link_url":"https://globalnews.ca/news/9978691/leah-remini-scientology-harassment-lawsuit-mother-friends/?utm_campaign=later-linkinbio-globalnews&utm_content=later-38049514&utm_medium=social&utm_source=linkin.bio","media_id":"17955837695530359","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/5e2146a30f9920-LIB38049514.jpg?width=240&height=240&t=1695560806&sig=231467f7507915f801d04983a3bf1c5e25e6b36e65efd9b6f3ea9b1d1007dc95","network_type":"instagram","post_id":309893984,"post_type":"feed","posted_time":1695567911,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":38041974,"caption":"The first-ever painting completed on television by Bob Ross — the beloved, perm-sporting artist who celebrated his “happy accidents” — is on sale for US$9.8 million (over C$13.2 million).⁠\n⁠\nRoss painted A Walk in the Woods in 1983 during the first episode of his TV show The Joy of Painting, which captured the hearts (and paintbrushes) of audiences around the globe. For 27 minutes, viewers watched Ross as he demonstrated how to paint a scenic, autumnal tree line.⁠\n⁠\nA Walk in the Woods was listed for sale by Ryan Nelson, who owns the art gallery Modern Artifact. The listing calls the artwork “the most historically significant Bob Ross original painting ever created.”⁠\n⁠\n“It is exceedingly rare to find any Bob Ross episode pieces, and this is a one-of-a-kind opportunity to own the very first one,” the gallery wrote.⁠\n⁠\nThe painting includes a red “Ross” signature from the artist, and comes with a written statement from the original, and only, owner who was there at the time this piece was painted by Bob Ross.⁠\n⁠\nThe previous owner, who is not named by Modern Artifact, bought the painting in an auction to raise funds for a local PBS station. After purchasing the piece for an undisclosed amount, the woman hung A Walk in the Woods in her home for 39 years, The Associated Press reported.⁠\n⁠\nThough Ross normally painted three versions of his works — a reference image before filming the TV show, one during filming and another for his step-by-step books — the version for sale was proven to be the one painted by Ross on camera. ⁠\n⁠\nThe Washington Post reported it took art analysts at Bob Ross Inc., the company that owns the rights to his TV show, two days to determine Ross’ brush strokes and knife work was identical to the version of A Walk in the Woods now owned by Modern Artifact.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage 1: Acey Harper/Getty Images⁠\nImage 2: AP Photo/Mark Vancleave","created_time":1695473705,"high_res_url":"https://image-cdn.later.com/t/linkinbio/e6994f0470b4d6-LIB38041974.jpg?width=960&t=1695473705&sig=dea7312703ec61e7577de0ca640e2b39e074acd443a05d4e3db00960690eeeda","image_url":"https://image-cdn.later.com/linkinbio/e6994f0470b4d6-LIB38041974.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/e6994f0470b4d6-LIB38041974.jpg?width=320&height=320&t=1695473705&sig=edd722a78aaa852e3746d16f049e25821ed2fcb055f1ed5d58d960186e737667","link_url":"https://globalnews.ca/news/9976319/bob-ross-painting-sale/?utm_campaign=later-linkinbio-globalnews&utm_content=later-38041974&utm_medium=social&utm_source=linkin.bio","media_id":"18235705465236698","media_type":"carousel","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/e6994f0470b4d6-LIB38041974.jpg?width=240&height=240&t=1695473705&sig=a28946237730d8be9719f345478c27d4a88096d4dffdb75825bf16a8e9c6db38","network_type":"instagram","post_id":309855938,"post_type":"feed","posted_time":1695484873,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":38032818,"caption":"On National Voter Registration Day in the U.S., Taylor Swift urged her millions of fans to Speak Now and let their democratic voices be heard. ⁠\n⁠\nHer callout led to “record-breaking traffic” to Vote.org,  a non-profit voting registration website, which said it saw the most sign-ups in years thanks to the pop star’s help.⁠\n⁠\nSwift shared a message on her Instagram story Tuesday morning asking her fans if they had registered to vote yet for the upcoming 2024 U.S. elections.⁠\n⁠\n“I’ve been so lucky to see so many of you guys at my US shows recently. I’ve heard you raise your voices, and I know how powerful they are. Make sure you’re ready to use them in our elections this year!”⁠\n⁠\nWithin the hour that Swift made her post, traffic on the Vote.org website shot up 1226 per cent, according to Vote.org CEO Andrea Hailey.⁠\n⁠\n“Our site was averaging 13,000 users every 30 minutes — a number that Taylor Swift would be proud of,” Hailey wrote in a press release shared with Global News.⁠\n⁠\nThirteen, as Swifties would know, is the pop star’s lucky number.⁠\n⁠\nIn total, 35,252 people registered to vote through the site on Tuesday, an improvement of 22.5 per cent compared with last year’s campaign. Vote.org states that this year’s National Voter Registration Day was the most successful since 2020, a year that saw now-President Joe Biden face off against then-incumbent Donald Trump in a highly contentious election.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Hector Vivas/TAS23/Getty Images for TAS Rights Management","created_time":1695408164,"high_res_url":"https://image-cdn.later.com/t/linkinbio/0c75c26d5f9f41-LIB38032818.jpg?width=960&t=1695408164&sig=778a1541336af38420fa671088225f82846febf20b6d7f4555c24d3753442648","image_url":"https://image-cdn.later.com/linkinbio/0c75c26d5f9f41-LIB38032818.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/0c75c26d5f9f41-LIB38032818.jpg?width=320&height=320&t=1695408164&sig=cadacfa48023cb565e0bc2cee4425c2bbd83313239b448d8f1c00f7e9bf11fb5","link_url":"https://globalnews.ca/news/9978763/taylor-swift-post-voter-registration/?utm_campaign=later-linkinbio-globalnews&utm_content=later-38032818&utm_medium=social&utm_source=linkin.bio","media_id":"17998992583980519","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/0c75c26d5f9f41-LIB38032818.jpg?width=240&height=240&t=1695408164&sig=d18c2a072b23454689df979e995398c40f050b0d99bf50109e3c69f5dd3c2e0c","network_type":"instagram","post_id":309807675,"post_type":"feed","posted_time":1695408255,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":38010220,"caption":"The divorce between Joe Jonas and Sophie Turner continues to get messier and more complicated by the day, and now Turner is suing her soon-to-be ex-husband and requesting that their two children be returned to England to live with her.⁠\n⁠\nAccording to legal documents, obtained by Entertainment Tonight, Turner has petitioned for the “immediate return” of their one- and three-year-old daughters. The documents state the couple made England their permanent home earlier this year.⁠\n⁠\nThe documents also reveal that the custody arrangement that’s been in the works as part of the divorce proceedings has become a point of contention.⁠\n⁠\n“On or about September 17, 2023, the parties met to discuss their separation,” the docs state, according to ET. “(Turner) reiterated the parties’ agreed plan for the children to return home to England that week. (Jonas) has possession of the children’s passports. He refuses to return the passports to (Turner) and refuses to send the children home to England with (Turner).”⁠\n⁠\nThe documents also allege that Turner found out about the divorce not from Jonas or his legal team – but from the media.⁠\n⁠\nJonas hit back at those claims Thursday just hours after news broke of Turner’s lawsuit.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Fs/AdMedia via ZUMA Press Wire","created_time":1695334324,"high_res_url":"https://image-cdn.later.com/t/linkinbio/b5385a007ce150-LIB38010220.jpg?width=960&t=1695334324&sig=00ccd498e468cf13ebb73fbf4227bec8b9ef553669c76be950fb758cc2c33a18","image_url":"https://image-cdn.later.com/linkinbio/b5385a007ce150-LIB38010220.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/b5385a007ce150-LIB38010220.jpg?width=320&height=320&t=1695334324&sig=64f21447ecd440606ea96312b93a517e4bde32e9fd373203dc67d2e14b2cb41c","link_url":"https://globalnews.ca/news/9977220/sophie-turner-sue-joe-jonas-divorce-kids-uk/?utm_campaign=later-linkinbio-globalnews&utm_content=later-38010220&utm_medium=social&utm_source=linkin.bio","media_id":"18073143160408260","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/b5385a007ce150-LIB38010220.jpg?width=240&height=240&t=1695334324&sig=1f980f658478f9c2054bcbac5693d96da9a1a6c635668738237b436ce6d697aa","network_type":"instagram","post_id":309707538,"post_type":"feed","posted_time":1695336611,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37999856,"caption":"The family of a teenage girl says that they were shocked when their daughter allegedly discovered an iPhone taped to the back of an airplane toilet seat, and they believe a member of the crew put it there in hopes of capturing footage of the 14-year-old using the washroom.⁠\n⁠\nThe family was travelling on American Airlines from Charlotte, N.C., to Boston on Sept. 2 when the alleged incident occurred.⁠\n⁠\nA photo of the phone, which was mostly covered by red and white tape, save for the flash and camera functions on the back of the device, had “Inoperative Catering Equipment” and “Remove From Service” printed on it with a note written in marker that said “Seat Broken.”⁠\n⁠\nThe picture was provided to the media by law firm Lewis & Llewellyn, LLP, which is representing the family.⁠\n⁠\nFamily members told the Post that their daughter had been waiting in line to use the coach washroom, when a male flight attendant approached the girl and offered to bring her to first class, saying there was no line up for the washroom there.⁠\n⁠\nThe family alleges that the crew member brought her to the front of the plane, but slipped in front of the girl, telling her he needed to quickly wash his hands before she used the facilities.⁠\n⁠\nAs he exited the washroom, he told the girl that the toilet seat was broken but not to worry about it, the family said in a written statement.⁠\n⁠\nIt wasn’t until after she flushed that she noticed the phone and took a photo of it, the family said.⁠\n⁠\nThe flight attendant then entered the washroom after she left, the family claims.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Supplied⁠\n","created_time":1695310795,"high_res_url":"https://image-cdn.later.com/t/linkinbio/156027b738c822-LIB37999856.jpg?width=960&t=1695310795&sig=8e2e6a67863e9b9f5974a5184764c07d624455cef9f03c791c81f326fb7ebf2a","image_url":"https://image-cdn.later.com/linkinbio/156027b738c822-LIB37999856.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/156027b738c822-LIB37999856.jpg?width=320&height=320&t=1695310795&sig=9fde60ee9d950dd45c3edf488386116d7dca8f49e9d5e28097a60143255a6bb2","link_url":"https://globalnews.ca/news/9971139/teen-girl-iphone-plane-toilet-seat-american-airlines/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37999856&utm_medium=social&utm_source=linkin.bio","media_id":"17923904108688815","media_type":"carousel","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/156027b738c822-LIB37999856.jpg?width=240&height=240&t=1695310795&sig=1a358ac12c12bdfaeef85ed472d00fcf84fa5809df30bf484d0fea6a9640a949","network_type":"instagram","post_id":309660510,"post_type":"feed","posted_time":1695333437,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37942976,"caption":"What is arguably one of Princess Diana‘s most iconic pieces of clothing has just come off the auction block, fetching more than 20 times the price for which it was expected to sell.⁠\n⁠\nThe sweater, a red pattern featuring a swath of white sheep and a lone black sheep, just sold on Sotheby’s for US$1.143 million (CA$1.544 million.)⁠\n⁠\nThe sale, which fetched a total of 44 bids, marks a world record for a sweater sold at auction. A 15-minute battle near closing time drove the sale from a paltry $190,000 to $900,000. With fees, the lucky buyer will pay more than $1.1 million.⁠\n⁠\nKnown commonly as the “black sheep” sweater, a 19-year-old Diana was photographed wearing the jumper in 1981 while attending one of the polo matches of the now King Charles, to whom she was engaged to at the time.⁠\n⁠\nAccording to Sotheby’s, the quirky knit’s sale eclipses the previous record holder — the cardigan worn by Nirvana’s Kurt Cobain when he performed onstage during MTV’s Unplugged, which sold for $334,000 in 2019.⁠\n⁠\nThe black sheep sweater was designed by Sally Muir and Joanna Osborne under their Warm & Wonderful label and began selling in the early 1980s. The price of one of the sweaters at that time was around $50.⁠\n⁠\nWhile the sweater’s pattern, at glance, is bright and whimsical, it’s gathered darker meaning over time with many drawing comparison between the lone black sheep on the sweater to Diana’s struggle to fit in with the royal family and find her footing within The Firm.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Getty Images / Sotheby's","created_time":1695135094,"high_res_url":"https://image-cdn.later.com/t/linkinbio/b99690c5833b7d-LIB37942976.jpg?width=960&t=1695135094&sig=2c90830fe3ded3e3298c8cc7acb484f917479043422614dee83a8a746500e591","image_url":"https://image-cdn.later.com/linkinbio/b99690c5833b7d-LIB37942976.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/b99690c5833b7d-LIB37942976.jpg?width=320&height=320&t=1695135094&sig=609b51a56006b983c8ff6b10eb4684df7d89aa1430e1b64a813b27d620b95fd5","link_url":"https://globalnews.ca/news/9961631/princess-diana-black-sheep-sweater-sold-auction-record/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37942976&utm_medium=social&utm_source=linkin.bio","media_id":"18402186835051682","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/b99690c5833b7d-LIB37942976.jpg?width=240&height=240&t=1695135094&sig=e41698edb0b53873a9aedd935096eb28c6790e33ed687aa20cf1072215e44f31","network_type":"instagram","post_id":309353427,"post_type":"feed","posted_time":1695135135,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37923698,"caption":"Drew Barrymore is now saying that her talk show will not return until the Hollywood strikes are over.⁠\n⁠\nThe about-face comes after a week of backlash and allegations that Barrymore was a “scab” for resuming filming the Drew Barrymore Show while the Writers Guild of America (WGA) and Screen Actors Guild (SAG-AFTRA) continue to strike.⁠\n⁠\nBarrymore announced the decision on Sunday in an Instagram post, writing: “I have listened to everyone, and I am making the decision to pause the show’s premiere until the strike is over. I have no words to express my deepest apologies to anyone I have hurt and, of course, to our incredible team who works on the show and has made it what it is today.”⁠\n⁠\nComments under the post were mainly positive, with fans and fellow actors celebrating the move.⁠\n⁠\nThe fourth season of Barrymore’s talk show was slated to return to TV on Monday. Filming for the new episodes moved ahead last week — without her three union writers — while picketers protested outside her New York studio.⁠\n⁠\nCBS Media Ventures, which distributes The Drew Barrymore Show, expressed support for the actor’s decision to delay the season’s premiere.⁠\n⁠\nThe backlash against Barrymore for resuming production of her talk show during the Hollywood strikes was swift.⁠\n⁠\nA day after filming relaunched, the 50 First Dates actor was dropped as the host for the National Book Foundation’s annual book awards.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Getty","created_time":1695066576,"high_res_url":"https://image-cdn.later.com/t/linkinbio/e1995a44bf01f6-LIB37923698.jpg?width=960&t=1695066576&sig=56101848b4981fef3e786d81c263dd1fc79c6a9610258edb6ef9675b041a5816","image_url":"https://image-cdn.later.com/linkinbio/e1995a44bf01f6-LIB37923698.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/e1995a44bf01f6-LIB37923698.jpg?width=320&height=320&t=1695066576&sig=569eec3c37873c1320cf05cc214288eaf8973ee4cfb619837ffd1e3318763ef3","link_url":"https://globalnews.ca/news/9967882/drew-barrymore-show-hollywood-strikes/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37923698&utm_medium=social&utm_source=linkin.bio","media_id":"18081588238381597","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/e1995a44bf01f6-LIB37923698.jpg?width=240&height=240&t=1695066576&sig=c5048054a9648a7b6de21215d392ecf5c2551630c59890f272326919616313fe","network_type":"instagram","post_id":309256211,"post_type":"feed","posted_time":1695066618,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37875417,"caption":"Every now and then, your favourite TV shows might be able to teach you something important.⁠\n⁠\nThat was the case for 12-year-old Austen MacMillan of Florida, who saved a man from drowning thanks to CPR he learned while watching the popular science fiction/horror series Stranger Things.⁠\n⁠\nMacMillan and his behavioural therapist, Jason Piquette, were swimming in the pool at MacMillan’s Palm Beach County home when Piquette suffered a medical emergency. According to ABC News, MacMillan watched on as Piquette attempted to see how long he could hold his breath underwater.⁠\n⁠\nWhile underwater, Piquette seemingly lost consciousness.⁠\n⁠\nThe tween was captured by a Ring camera as he pulled Piquette out of the water and onto the pool steps.⁠\n⁠\nMacMillan left the pool area briefly to call for help from his driveway. He then returned to the pool and began to perform CPR on Piquette. MacMillan is not CPR certified, but said he followed what he’d witnessed while watching the Netflix series Stranger Things.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Getty","created_time":1694799876,"high_res_url":"https://image-cdn.later.com/t/linkinbio/acf81f54e604c6-LIB37875417.jpg?width=960&t=1694799876&sig=2dbb8fe14c1fd20f20dd2e5be5a474da975931c6d0ff6a585ee9892a66a7d385","image_url":"https://image-cdn.later.com/linkinbio/acf81f54e604c6-LIB37875417.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/acf81f54e604c6-LIB37875417.jpg?width=320&height=320&t=1694799876&sig=51564dc55bc8e586b6269421b01f79a1e67f7cc9872381b45ac56f3615fc5928","link_url":"https://globalnews.ca/news/9957608/12-year-old-boy-saves-drowning-man-cpr-learned-from-stranger-things/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37875417&utm_medium=social&utm_source=linkin.bio","media_id":"17864462273960115","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/acf81f54e604c6-LIB37875417.jpg?width=240&height=240&t=1694799876&sig=8a69f8d040a118bf0a4356dbda5a8712d3d26654890bd024037e15dc265af4f2","network_type":"instagram","post_id":309014534,"post_type":"feed","posted_time":1694799915,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37853421,"caption":"Apple has been ordered to stop selling the iPhone 12 in France after a government agency found it can emit high levels of electromagnetic radiation that surpass EU rules.⁠\n⁠\nDon’t throw out your iPhones just yet, though. France’s Minister for Digital Transition says the measured radiation is still “significantly lower” than what scientists consider harmful to humans, and Apple can bring the smartphone model back into compliance with “a simple update.”⁠\n⁠\nIn addition to halting sales, the National Frequency Agency (ANFR) is calling on Apple to “implement all available means to quickly remedy this malfunction” in the iPhone 12. If it fails to do so, Apple will have to recall the iPhone 12, the agency said Tuesday.⁠\n⁠\nApple has disputed the ANFR’s findings, and says it has sent the agency multiple lab results — carried out in-house and by third-party labs — showing that the iPhone 12 is in compliance with EU regulations.⁠\n⁠\nThe ANFR regularly tests mobile phones in the French market to ensure the public are protected from exposure to electromagnetic waves, the agency says. ⁠\n⁠\nRecently, it tested 141 phones models, including the iPhone 12, and evaluated their specific absorption rates (SAR), a measure of how much energy is absorbed by the human body when exposed to an electromagnetic field.⁠\n⁠\nThe iPhone 12 failed one of the two key tests. When the iPhone was held in a hand or carried in a pocket, regulators measured an SAR of 5.74 watts per kilograms, higher than the EU standard of 4 watts per kilogram.⁠\n⁠\nWhen the iPhone was carried in a bag or kept in a jacket, it was compliant with the EU benchmark of 2 watts per kilogram absorbed by the body.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Getty","created_time":1694728003,"high_res_url":"https://image-cdn.later.com/t/linkinbio/c751ab97e6f2cc-LIB37853421.jpg?width=960&t=1694728003&sig=45299591d91d2c3c031f81aa0e0d7405787c29195e59863f9aecbb41801e13ad","image_url":"https://image-cdn.later.com/linkinbio/c751ab97e6f2cc-LIB37853421.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/c751ab97e6f2cc-LIB37853421.jpg?width=320&height=320&t=1694728003&sig=7a1e5b3d305e7219bcd06b54b27d7308e1a6ea92c990071fcde3bcf2104c31aa","link_url":"https://globalnews.ca/news/9958025/iphone-12-radiation-france-apple/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37853421&utm_medium=social&utm_source=linkin.bio","media_id":"18203660203254961","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/c751ab97e6f2cc-LIB37853421.jpg?width=240&height=240&t=1694728003&sig=b70cf626b4ff7be5567d4b078d8c4f4041fdcb7b2afbf2b7c514d2a358131856","network_type":"instagram","post_id":308917601,"post_type":"feed","posted_time":1694728215,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37850691,"caption":"A Seattle police officer is under investigation after he was caught on video joking about a young woman who died after being struck by a police vehicle and suggested her life had “limited value.”⁠\n⁠\nOfficer Daniel Auderer, who is also the vice president of the city’s police union, inadvertently left his body camera running after responding to the scene of an accident in which another officer, Kevin Dave, struck and killed 23-year-old Jaahnavi Kandula.⁠\n⁠\nThe accident occurred on Jan. 23 as Dave was responding to a call about an overdose. He was driving 74 mph (about 120 km/h) when he collided with Kandula, who was in a crosswalk at the intersection of Thomas Street and Dexter Avenue North, the Seattle Times reported. Her body was flung over 100 feet (30 metres).⁠\n⁠\nKandula, who was a master’s student at Northeastern University, died from her injuries.⁠\n⁠\nAs a drug-recognition officer, Auderer was called to the scene to determine if Dave was under the influence when he crashed into Kandula. After finishing his analysis, Auderer left the area in his police cruiser and called Mike Solan, president of the Seattle Police Officers Guild (SPOG).⁠\n⁠\nThe roughly two-minute conversation between the two union leaders was released to the public by the Seattle Police Department “in the interest of transparency.”⁠\n⁠\nOnly Auderer’s side of the conversation is audible in the body-camera video, which captures him laughing multiple times while discussing Kandula’s death.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n","created_time":1694721075,"high_res_url":"https://image-cdn.later.com/t/linkinbio/4454e91c3fdff8-LIB37850691.jpg?width=960&t=1694721075&sig=f30e6c5445218068996b2cb76fd027cedb399d387d868984e07e73983a598f0f","image_url":"https://image-cdn.later.com/linkinbio/4454e91c3fdff8-LIB37850691.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/4454e91c3fdff8-LIB37850691.jpg?width=320&height=320&t=1694721075&sig=ea731dbe02dcb70153d56ab1a8e1039e1783cca5b8de103fb158c7bd66595abb","link_url":"https://globalnews.ca/news/9957269/seattle-police-body-camera-daniel-auderer-jaahnavi-kandula/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37850691&utm_medium=social&utm_source=linkin.bio","media_id":"17914975388796115","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/4454e91c3fdff8-LIB37850691.jpg?width=240&height=240&t=1694721075&sig=cae40153965332e9f1fd20dcb4a9dc998415c7cbb6257f3e56d37f4406e5c82d","network_type":"instagram","post_id":308904834,"post_type":"feed","posted_time":1694721193,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37849663,"caption":"Just one day after announcing they’re on the hunt for a reporter to cover all things Taylor Swift, America’s largest newspaper chain has now posted another niche reporting job, covering none other than Beyoncé.⁠\n⁠\nAccording to the job listings, each writer will work principally for the Tennessean newspaper and USA Today, but their content will be distributed across the entire Gannett news chain.⁠\n⁠\nBoth Swift and Beyoncé have major world tours underway. Beyoncé’s Renaissance World Tour is set to end next month, while Swift’s Eras Tour will run through the end of 2024.⁠\n⁠\nAnd while it’s not rare for newspaper chains to hire entertainment critics and music reporters, it’s not often that a reporter is assigned to cover a single artist.⁠\n⁠\nHowever, Beyoncé and Swift both hold a huge amount of cultural and economic sway and their fans – the Beyhive and Swifties, respectively – are known to financially bolster entire cities when the performers come to town.⁠\n⁠\nThe qualifications for each Gannett job read the same, and each listing invites applicants with “a voice – but not a bias” to throw their resumes into the ring. ⁠\n⁠\nThe hire will be expected to report not just on the details and highlights of each singer’s tours, but also on their fanbase, their impact on the worlds of music and business, as well as their cultural relevance.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Kevin Mazur/WireImage for Parkwood⁠\n⁠\nImage: Natasha Moustache/TAS23/Getty Images for TAS Rights Management","created_time":1694718659,"high_res_url":"https://image-cdn.later.com/t/linkinbio/b6bdbdb7a0eb23-LIB37849663.jpg?width=960&t=1694718659&sig=d0cd28a5109d68c99691fdadb242724d981ceac4f2262537a22924d4455e5a2a","image_url":"https://image-cdn.later.com/linkinbio/b6bdbdb7a0eb23-LIB37849663.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/b6bdbdb7a0eb23-LIB37849663.jpg?width=320&height=320&t=1694718659&sig=1970ac15b018ff492681c1eadb2fb6faa849bc82b57239e298d4dc0cf41a7ae2","link_url":"https://globalnews.ca/news/9957924/taylor-swift-beyonce-reporter-job-postings-gannett/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37849663&utm_medium=social&utm_source=linkin.bio","media_id":"18003814891866732","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/b6bdbdb7a0eb23-LIB37849663.jpg?width=240&height=240&t=1694718659&sig=83d75805696241572e400d8357274f5498aa29a7902f8105e13c4bfd86892687","network_type":"instagram","post_id":308899850,"post_type":"feed","posted_time":1694718733,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37819556,"caption":"Drew Barrymore will no longer host the 74th U.S. National Book Awards following an announcement that she would continue production of her daytime talk show amid the WGA and SAG-AFTRA strikes.⁠\n⁠\nThe National Book Foundation rescinded their offer to Barrymore, 48, on Tuesday, one day after The Drew Barrymore Show began filming its fourth season.⁠\n⁠\n“The National Book Awards is an evening dedicated to celebrating the power of literature, and the incomparable contributions of writers to our culture,” the foundation wrote in a statement. “In light of the announcement that ‘The Drew Barrymore Show’ will resume production, the National Book Foundation has rescinded Ms. Barrymore’s invitation to host the 74th National Book Awards Ceremony.”⁠\n⁠\n“Our commitment is to ensure that the focus of the Awards remains on celebrating writers and books, and we are grateful to Ms. Barrymore and her team for their understanding in this situation.”⁠\n⁠\nBarrymore has not commented publicly on her ousting as host.⁠\n⁠\nHigh-ranking members of the National Book Foundation have previously applauded Barrymore for promoting and discussing books on her talk show.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: John Lamparski/WireImage","created_time":1694625925,"high_res_url":"https://image-cdn.later.com/t/linkinbio/febc3f9f79f5f5-LIB37819556.jpg?width=960&t=1694625925&sig=c4e1b95a2f162431336980f71ee60a241797a3e13637f8873e32bc514e3be694","image_url":"https://image-cdn.later.com/linkinbio/febc3f9f79f5f5-LIB37819556.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/febc3f9f79f5f5-LIB37819556.jpg?width=320&height=320&t=1694625925&sig=72c1fc110702f15fc759fca202bf48bb232c07c561ed5707da33528b4d2a1191","link_url":"https://globalnews.ca/news/9957224/drew-barrymore-awards-host-dropped-talk-show-strike/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37819556&utm_medium=social&utm_source=linkin.bio","media_id":"17991159914472031","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/febc3f9f79f5f5-LIB37819556.jpg?width=240&height=240&t=1694625925&sig=c33fb00db60df12483d2cb2f54200082e501ef2cc1d3d1b5f3c25ec1f16a6768","network_type":"instagram","post_id":308757233,"post_type":"feed","posted_time":1694625973,"social_profile_id":3553390,"linkinbio_post_links":[]}],"linkinbio_page_id":37292}