{"linkinbio_posts":[{"id":37942976,"caption":"What is arguably one of Princess Diana‘s most iconic pieces of clothing has just come off the auction block, fetching more than 20 times the price for which it was expected to sell.⁠\n⁠\nThe sweater, a red pattern featuring a swath of white sheep and a lone black sheep, just sold on Sotheby’s for US$1.143 million (CA$1.544 million.)⁠\n⁠\nThe sale, which fetched a total of 44 bids, marks a world record for a sweater sold at auction. A 15-minute battle near closing time drove the sale from a paltry $190,000 to $900,000. With fees, the lucky buyer will pay more than $1.1 million.⁠\n⁠\nKnown commonly as the “black sheep” sweater, a 19-year-old Diana was photographed wearing the jumper in 1981 while attending one of the polo matches of the now King Charles, to whom she was engaged to at the time.⁠\n⁠\nAccording to Sotheby’s, the quirky knit’s sale eclipses the previous record holder — the cardigan worn by Nirvana’s Kurt Cobain when he performed onstage during MTV’s Unplugged, which sold for $334,000 in 2019.⁠\n⁠\nThe black sheep sweater was designed by Sally Muir and Joanna Osborne under their Warm & Wonderful label and began selling in the early 1980s. The price of one of the sweaters at that time was around $50.⁠\n⁠\nWhile the sweater’s pattern, at glance, is bright and whimsical, it’s gathered darker meaning over time with many drawing comparison between the lone black sheep on the sweater to Diana’s struggle to fit in with the royal family and find her footing within The Firm.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Getty Images / Sotheby's","created_time":1695135094,"high_res_url":"https://image-cdn.later.com/t/linkinbio/b99690c5833b7d-LIB37942976.jpg?width=960&t=1695135094&sig=2c90830fe3ded3e3298c8cc7acb484f917479043422614dee83a8a746500e591","image_url":"https://image-cdn.later.com/linkinbio/b99690c5833b7d-LIB37942976.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/b99690c5833b7d-LIB37942976.jpg?width=320&height=320&t=1695135094&sig=609b51a56006b983c8ff6b10eb4684df7d89aa1430e1b64a813b27d620b95fd5","link_url":"https://globalnews.ca/news/9961631/princess-diana-black-sheep-sweater-sold-auction-record/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37942976&utm_medium=social&utm_source=linkin.bio","media_id":"18402186835051682","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/b99690c5833b7d-LIB37942976.jpg?width=240&height=240&t=1695135094&sig=e41698edb0b53873a9aedd935096eb28c6790e33ed687aa20cf1072215e44f31","network_type":"instagram","post_id":309353427,"post_type":"feed","posted_time":1695135135,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37923698,"caption":"Drew Barrymore is now saying that her talk show will not return until the Hollywood strikes are over.⁠\n⁠\nThe about-face comes after a week of backlash and allegations that Barrymore was a “scab” for resuming filming the Drew Barrymore Show while the Writers Guild of America (WGA) and Screen Actors Guild (SAG-AFTRA) continue to strike.⁠\n⁠\nBarrymore announced the decision on Sunday in an Instagram post, writing: “I have listened to everyone, and I am making the decision to pause the show’s premiere until the strike is over. I have no words to express my deepest apologies to anyone I have hurt and, of course, to our incredible team who works on the show and has made it what it is today.”⁠\n⁠\nComments under the post were mainly positive, with fans and fellow actors celebrating the move.⁠\n⁠\nThe fourth season of Barrymore’s talk show was slated to return to TV on Monday. Filming for the new episodes moved ahead last week — without her three union writers — while picketers protested outside her New York studio.⁠\n⁠\nCBS Media Ventures, which distributes The Drew Barrymore Show, expressed support for the actor’s decision to delay the season’s premiere.⁠\n⁠\nThe backlash against Barrymore for resuming production of her talk show during the Hollywood strikes was swift.⁠\n⁠\nA day after filming relaunched, the 50 First Dates actor was dropped as the host for the National Book Foundation’s annual book awards.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Getty","created_time":1695066576,"high_res_url":"https://image-cdn.later.com/t/linkinbio/e1995a44bf01f6-LIB37923698.jpg?width=960&t=1695066576&sig=56101848b4981fef3e786d81c263dd1fc79c6a9610258edb6ef9675b041a5816","image_url":"https://image-cdn.later.com/linkinbio/e1995a44bf01f6-LIB37923698.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/e1995a44bf01f6-LIB37923698.jpg?width=320&height=320&t=1695066576&sig=569eec3c37873c1320cf05cc214288eaf8973ee4cfb619837ffd1e3318763ef3","link_url":"https://globalnews.ca/news/9967882/drew-barrymore-show-hollywood-strikes/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37923698&utm_medium=social&utm_source=linkin.bio","media_id":"18081588238381597","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/e1995a44bf01f6-LIB37923698.jpg?width=240&height=240&t=1695066576&sig=c5048054a9648a7b6de21215d392ecf5c2551630c59890f272326919616313fe","network_type":"instagram","post_id":309256211,"post_type":"feed","posted_time":1695066618,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37875417,"caption":"Every now and then, your favourite TV shows might be able to teach you something important.⁠\n⁠\nThat was the case for 12-year-old Austen MacMillan of Florida, who saved a man from drowning thanks to CPR he learned while watching the popular science fiction/horror series Stranger Things.⁠\n⁠\nMacMillan and his behavioural therapist, Jason Piquette, were swimming in the pool at MacMillan’s Palm Beach County home when Piquette suffered a medical emergency. According to ABC News, MacMillan watched on as Piquette attempted to see how long he could hold his breath underwater.⁠\n⁠\nWhile underwater, Piquette seemingly lost consciousness.⁠\n⁠\nThe tween was captured by a Ring camera as he pulled Piquette out of the water and onto the pool steps.⁠\n⁠\nMacMillan left the pool area briefly to call for help from his driveway. He then returned to the pool and began to perform CPR on Piquette. MacMillan is not CPR certified, but said he followed what he’d witnessed while watching the Netflix series Stranger Things.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Getty","created_time":1694799876,"high_res_url":"https://image-cdn.later.com/t/linkinbio/acf81f54e604c6-LIB37875417.jpg?width=960&t=1694799876&sig=2dbb8fe14c1fd20f20dd2e5be5a474da975931c6d0ff6a585ee9892a66a7d385","image_url":"https://image-cdn.later.com/linkinbio/acf81f54e604c6-LIB37875417.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/acf81f54e604c6-LIB37875417.jpg?width=320&height=320&t=1694799876&sig=51564dc55bc8e586b6269421b01f79a1e67f7cc9872381b45ac56f3615fc5928","link_url":"https://globalnews.ca/news/9957608/12-year-old-boy-saves-drowning-man-cpr-learned-from-stranger-things/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37875417&utm_medium=social&utm_source=linkin.bio","media_id":"17864462273960115","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/acf81f54e604c6-LIB37875417.jpg?width=240&height=240&t=1694799876&sig=8a69f8d040a118bf0a4356dbda5a8712d3d26654890bd024037e15dc265af4f2","network_type":"instagram","post_id":309014534,"post_type":"feed","posted_time":1694799915,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37853421,"caption":"Apple has been ordered to stop selling the iPhone 12 in France after a government agency found it can emit high levels of electromagnetic radiation that surpass EU rules.⁠\n⁠\nDon’t throw out your iPhones just yet, though. France’s Minister for Digital Transition says the measured radiation is still “significantly lower” than what scientists consider harmful to humans, and Apple can bring the smartphone model back into compliance with “a simple update.”⁠\n⁠\nIn addition to halting sales, the National Frequency Agency (ANFR) is calling on Apple to “implement all available means to quickly remedy this malfunction” in the iPhone 12. If it fails to do so, Apple will have to recall the iPhone 12, the agency said Tuesday.⁠\n⁠\nApple has disputed the ANFR’s findings, and says it has sent the agency multiple lab results — carried out in-house and by third-party labs — showing that the iPhone 12 is in compliance with EU regulations.⁠\n⁠\nThe ANFR regularly tests mobile phones in the French market to ensure the public are protected from exposure to electromagnetic waves, the agency says. ⁠\n⁠\nRecently, it tested 141 phones models, including the iPhone 12, and evaluated their specific absorption rates (SAR), a measure of how much energy is absorbed by the human body when exposed to an electromagnetic field.⁠\n⁠\nThe iPhone 12 failed one of the two key tests. When the iPhone was held in a hand or carried in a pocket, regulators measured an SAR of 5.74 watts per kilograms, higher than the EU standard of 4 watts per kilogram.⁠\n⁠\nWhen the iPhone was carried in a bag or kept in a jacket, it was compliant with the EU benchmark of 2 watts per kilogram absorbed by the body.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Getty","created_time":1694728003,"high_res_url":"https://image-cdn.later.com/t/linkinbio/c751ab97e6f2cc-LIB37853421.jpg?width=960&t=1694728003&sig=45299591d91d2c3c031f81aa0e0d7405787c29195e59863f9aecbb41801e13ad","image_url":"https://image-cdn.later.com/linkinbio/c751ab97e6f2cc-LIB37853421.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/c751ab97e6f2cc-LIB37853421.jpg?width=320&height=320&t=1694728003&sig=7a1e5b3d305e7219bcd06b54b27d7308e1a6ea92c990071fcde3bcf2104c31aa","link_url":"https://globalnews.ca/news/9958025/iphone-12-radiation-france-apple/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37853421&utm_medium=social&utm_source=linkin.bio","media_id":"18203660203254961","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/c751ab97e6f2cc-LIB37853421.jpg?width=240&height=240&t=1694728003&sig=b70cf626b4ff7be5567d4b078d8c4f4041fdcb7b2afbf2b7c514d2a358131856","network_type":"instagram","post_id":308917601,"post_type":"feed","posted_time":1694728215,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37850691,"caption":"A Seattle police officer is under investigation after he was caught on video joking about a young woman who died after being struck by a police vehicle and suggested her life had “limited value.”⁠\n⁠\nOfficer Daniel Auderer, who is also the vice president of the city’s police union, inadvertently left his body camera running after responding to the scene of an accident in which another officer, Kevin Dave, struck and killed 23-year-old Jaahnavi Kandula.⁠\n⁠\nThe accident occurred on Jan. 23 as Dave was responding to a call about an overdose. He was driving 74 mph (about 120 km/h) when he collided with Kandula, who was in a crosswalk at the intersection of Thomas Street and Dexter Avenue North, the Seattle Times reported. Her body was flung over 100 feet (30 metres).⁠\n⁠\nKandula, who was a master’s student at Northeastern University, died from her injuries.⁠\n⁠\nAs a drug-recognition officer, Auderer was called to the scene to determine if Dave was under the influence when he crashed into Kandula. After finishing his analysis, Auderer left the area in his police cruiser and called Mike Solan, president of the Seattle Police Officers Guild (SPOG).⁠\n⁠\nThe roughly two-minute conversation between the two union leaders was released to the public by the Seattle Police Department “in the interest of transparency.”⁠\n⁠\nOnly Auderer’s side of the conversation is audible in the body-camera video, which captures him laughing multiple times while discussing Kandula’s death.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n","created_time":1694721075,"high_res_url":"https://image-cdn.later.com/t/linkinbio/4454e91c3fdff8-LIB37850691.jpg?width=960&t=1694721075&sig=f30e6c5445218068996b2cb76fd027cedb399d387d868984e07e73983a598f0f","image_url":"https://image-cdn.later.com/linkinbio/4454e91c3fdff8-LIB37850691.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/4454e91c3fdff8-LIB37850691.jpg?width=320&height=320&t=1694721075&sig=ea731dbe02dcb70153d56ab1a8e1039e1783cca5b8de103fb158c7bd66595abb","link_url":"https://globalnews.ca/news/9957269/seattle-police-body-camera-daniel-auderer-jaahnavi-kandula/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37850691&utm_medium=social&utm_source=linkin.bio","media_id":"17914975388796115","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/4454e91c3fdff8-LIB37850691.jpg?width=240&height=240&t=1694721075&sig=cae40153965332e9f1fd20dcb4a9dc998415c7cbb6257f3e56d37f4406e5c82d","network_type":"instagram","post_id":308904834,"post_type":"feed","posted_time":1694721193,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37849663,"caption":"Just one day after announcing they’re on the hunt for a reporter to cover all things Taylor Swift, America’s largest newspaper chain has now posted another niche reporting job, covering none other than Beyoncé.⁠\n⁠\nAccording to the job listings, each writer will work principally for the Tennessean newspaper and USA Today, but their content will be distributed across the entire Gannett news chain.⁠\n⁠\nBoth Swift and Beyoncé have major world tours underway. Beyoncé’s Renaissance World Tour is set to end next month, while Swift’s Eras Tour will run through the end of 2024.⁠\n⁠\nAnd while it’s not rare for newspaper chains to hire entertainment critics and music reporters, it’s not often that a reporter is assigned to cover a single artist.⁠\n⁠\nHowever, Beyoncé and Swift both hold a huge amount of cultural and economic sway and their fans – the Beyhive and Swifties, respectively – are known to financially bolster entire cities when the performers come to town.⁠\n⁠\nThe qualifications for each Gannett job read the same, and each listing invites applicants with “a voice – but not a bias” to throw their resumes into the ring. ⁠\n⁠\nThe hire will be expected to report not just on the details and highlights of each singer’s tours, but also on their fanbase, their impact on the worlds of music and business, as well as their cultural relevance.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Kevin Mazur/WireImage for Parkwood⁠\n⁠\nImage: Natasha Moustache/TAS23/Getty Images for TAS Rights Management","created_time":1694718659,"high_res_url":"https://image-cdn.later.com/t/linkinbio/b6bdbdb7a0eb23-LIB37849663.jpg?width=960&t=1694718659&sig=d0cd28a5109d68c99691fdadb242724d981ceac4f2262537a22924d4455e5a2a","image_url":"https://image-cdn.later.com/linkinbio/b6bdbdb7a0eb23-LIB37849663.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/b6bdbdb7a0eb23-LIB37849663.jpg?width=320&height=320&t=1694718659&sig=1970ac15b018ff492681c1eadb2fb6faa849bc82b57239e298d4dc0cf41a7ae2","link_url":"https://globalnews.ca/news/9957924/taylor-swift-beyonce-reporter-job-postings-gannett/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37849663&utm_medium=social&utm_source=linkin.bio","media_id":"18003814891866732","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/b6bdbdb7a0eb23-LIB37849663.jpg?width=240&height=240&t=1694718659&sig=83d75805696241572e400d8357274f5498aa29a7902f8105e13c4bfd86892687","network_type":"instagram","post_id":308899850,"post_type":"feed","posted_time":1694718733,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37819556,"caption":"Drew Barrymore will no longer host the 74th U.S. National Book Awards following an announcement that she would continue production of her daytime talk show amid the WGA and SAG-AFTRA strikes.⁠\n⁠\nThe National Book Foundation rescinded their offer to Barrymore, 48, on Tuesday, one day after The Drew Barrymore Show began filming its fourth season.⁠\n⁠\n“The National Book Awards is an evening dedicated to celebrating the power of literature, and the incomparable contributions of writers to our culture,” the foundation wrote in a statement. “In light of the announcement that ‘The Drew Barrymore Show’ will resume production, the National Book Foundation has rescinded Ms. Barrymore’s invitation to host the 74th National Book Awards Ceremony.”⁠\n⁠\n“Our commitment is to ensure that the focus of the Awards remains on celebrating writers and books, and we are grateful to Ms. Barrymore and her team for their understanding in this situation.”⁠\n⁠\nBarrymore has not commented publicly on her ousting as host.⁠\n⁠\nHigh-ranking members of the National Book Foundation have previously applauded Barrymore for promoting and discussing books on her talk show.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: John Lamparski/WireImage","created_time":1694625925,"high_res_url":"https://image-cdn.later.com/t/linkinbio/febc3f9f79f5f5-LIB37819556.jpg?width=960&t=1694625925&sig=c4e1b95a2f162431336980f71ee60a241797a3e13637f8873e32bc514e3be694","image_url":"https://image-cdn.later.com/linkinbio/febc3f9f79f5f5-LIB37819556.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/febc3f9f79f5f5-LIB37819556.jpg?width=320&height=320&t=1694625925&sig=72c1fc110702f15fc759fca202bf48bb232c07c561ed5707da33528b4d2a1191","link_url":"https://globalnews.ca/news/9957224/drew-barrymore-awards-host-dropped-talk-show-strike/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37819556&utm_medium=social&utm_source=linkin.bio","media_id":"17991159914472031","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/febc3f9f79f5f5-LIB37819556.jpg?width=240&height=240&t=1694625925&sig=c33fb00db60df12483d2cb2f54200082e501ef2cc1d3d1b5f3c25ec1f16a6768","network_type":"instagram","post_id":308757233,"post_type":"feed","posted_time":1694625973,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37767600,"caption":"Elon Musk and Canadian singer Grimes privately welcomed a third child together, according to a post the tech billionaire made on X, the social media platform formerly known as Twitter.⁠\n⁠\nNews that Musk and Grimes had a secret third child surfaced after the New York Times published a review of Musk’s upcoming biography, written by Walter Isaacson, in which the child is mentioned.⁠\n⁠\nMusk confirmed the rumours in response to a post made by entertainment news account Pop Base, which listed the unusual names of the pair’s three children.⁠\n⁠\nMusk wrote that the child is named Tau Techno Mechanicus. But according to Isaacson’s biography, the child’s legal name is Techno Mechanicus Musk and Tau is a nickname.⁠\n⁠\nAccording to the unreleased biography, which was obtained by the Los Angeles Times, Techno Mechanicus was born via a surrogate on June 2022. His nickname, Tau, is a reference to the Greek letter that is two times the value of pi, an irrational number important in geometry and mathematics.⁠\n⁠\nTau roughly equals to 6.28, a nod to Musk’s birthday on June 28.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Getty","created_time":1694464641,"high_res_url":"https://image-cdn.later.com/t/linkinbio/268e366f8278d6-LIB37767600.jpg?width=960&t=1694464641&sig=7cadd1adf7008d160007254d7848bc95d707bf19ee3f98646609fb043ad91168","image_url":"https://image-cdn.later.com/linkinbio/268e366f8278d6-LIB37767600.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/268e366f8278d6-LIB37767600.jpg?width=320&height=320&t=1694464641&sig=e1b44f8b20e4beb5e4d07e514c61289fc73125cad4bc09419ba5bf46b179afeb","link_url":"https://globalnews.ca/news/9951959/elon-musk-grimes-third-child/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37767600&utm_medium=social&utm_source=linkin.bio","media_id":"18369255715068263","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/268e366f8278d6-LIB37767600.jpg?width=240&height=240&t=1694464641&sig=4db2c29ccaf4ae6ef8eb37c2f9fb7cbb75bd5795b5759d3db38042e627dee812","network_type":"instagram","post_id":308510837,"post_type":"feed","posted_time":1694464699,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37722299,"caption":"A single, very spicy tortilla chip, known as the ‘One Chip Challenge,’ has been voluntarily pulled off shelves in the U.S. and Canada after a Massachusetts teen died of complications related to consuming the hot chip.⁠\n⁠\nThe “extremely hot tortilla chip,” made by the chipmaker Paqui, is sold individually in an intimidating, coffin-shaped box with a large skull on the front. The snack is flavoured with Carolina Reaper and Naga Viper peppers, two of the world’s hottest varieties.⁠\n⁠\nWhen 14-year-old Harris Wolobah from Worcester, Mass. ate the chip while at school last week, he died just hours later.⁠\n⁠\nOn the back of the box, the “One Chip Challenge” states it is meant for “adult consumption,” and should be kept away from children.⁠\n⁠\nHarris’ mother, Lois, told NBC Boston her son complained to the school nurse about a stomachache after he ate the chip on Sept. 1. Harris was sent home from school and later lost consciousness. He was brought to a nearby hospital, where he was later pronounced dead.⁠\n⁠\nThe exact cause of Harris’ death is not yet known, though an autopsy has been ordered.⁠\n⁠\nPaqui announced on Thursday the “One Chip Challenge” would be pulled from stores in reaction to Harris’ death.⁠\n⁠\n“The Paqui One Chip Challenge is intended for adults only, with clear and prominent labeling highlighting the chip is not for children or anyone sensitive to spicy foods or who has food allergies, is pregnant or has underlying health conditions,” the company wrote on its website.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImages: Steve LeBlanc via AP","created_time":1694207463,"high_res_url":"https://image-cdn.later.com/t/linkinbio/cef295dc784971-LIB37722299.jpg?width=960&t=1694207463&sig=f621e551b1424a63996736692892412ae0a23a3764fe33679a8ec204f733e101","image_url":"https://image-cdn.later.com/linkinbio/cef295dc784971-LIB37722299.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/cef295dc784971-LIB37722299.jpg?width=320&height=320&t=1694207463&sig=a9904e2ef7e3c81d8ec995df684558c14b2edcc6a8105fab250a472e1667ad63","link_url":"https://globalnews.ca/news/9947505/one-chip-challenge-removed-teen-dies-harris-wolobah/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37722299&utm_medium=social&utm_source=linkin.bio","media_id":"18020618095616458","media_type":"carousel","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/cef295dc784971-LIB37722299.jpg?width=240&height=240&t=1694207463&sig=f988464506b6945c1f54d160c621ba7042da7111e5de9f55748026444ca25947","network_type":"instagram","post_id":308280193,"post_type":"feed","posted_time":1694359813,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37721880,"caption":"A Florida man was arrested by the U.S. Coast Guard (USCG) last month after he attempted to cross the Atlantic Ocean in a homemade contraption similar to a human-sized hamster wheel.⁠\n⁠\nReza Baluchi, 44, was arrested on Aug. 26 about 110 kilometres (70 miles) off Tybee Island, Georgia, according to a criminal complaint.⁠\n⁠\nBaluchi, who is a marathon runner, allegedly told USCG officials he was attempting to “run to London” in his floating wheel constructed from wiring and buoys. The wheel — or as Baluchi calls it, the “bubble” — is equipped with paddles that turn as someone runs inside.⁠\n⁠\nMembers of the USCG asked Baluchi “standard boarding questions” about his vessel, including a request for proper registration. After Baluchi insisted the wheel was registered in Florida, but failed to produce the paperwork, USCG officials determined he was attempting “a manifestly unsafe voyage.”⁠\n⁠\nWhen asked to disembark from his wheel, Baluchi said he was carrying a 12-inch knife and threatened to kill himself. ⁠\n⁠\nHe also threatened to blow himself and his vessel up while “holding wires in his hand.” Baluchi later confessed to a USCG officer that he did not have a bomb in his possession.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Twitter @FlaglerSheriff","created_time":1694206296,"high_res_url":"https://image-cdn.later.com/t/linkinbio/c6d8312b748547-LIB37721880.jpg?width=960&t=1694206296&sig=7c8b82f75e6d92c783e0554f66dc6bae6961a403875261350c66ec082206869f","image_url":"https://image-cdn.later.com/linkinbio/c6d8312b748547-LIB37721880.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/c6d8312b748547-LIB37721880.jpg?width=320&height=320&t=1694206296&sig=ab469339cb73706f747687da8278e22a28cab6f62108637ece1c90b595dbf618","link_url":"https://globalnews.ca/news/9942416/florida-man-arrested-hamster-wheel-atlantic-ocean/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37721880&utm_medium=social&utm_source=linkin.bio","media_id":"18107093122336381","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/c6d8312b748547-LIB37721880.jpg?width=240&height=240&t=1694206296&sig=99129a890a00a7edd2cc868cd89ca658a8c80031d20681d647ffba9726079cc8","network_type":"instagram","post_id":308278003,"post_type":"feed","posted_time":1694358037,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37721742,"caption":"A surgical instrument about the size of a dinner plate was discovered inside the abdomen of a woman from New Zealand, 18 months after she underwent a caesarean section.⁠\n⁠\nThe patient, who has not been named publicly, reported chronic, crippling pain after giving birth at Auckland City Hospital in 2020.⁠\n⁠\nAccording to a report from New Zealand’s health and disability commissioner, Morag McDowell, the patient in her 20s had an extra-large Alexis wound retractor (AWR) — a soft, tubal device used to draw back the edges of a wound during surgery — lodged in her abdomen. An extra-large AWR can be as big as 17 centimetres.⁠\n⁠\nFor 18 months, the patient complained about pain. She was left without answers because the AWR is reportedly “non-radio opaque” and could not be seen by X-ray. On one occasion, the woman even went to the emergency room because the pain was so severe.⁠\n⁠\nMcDowell said Te Whatu Ora Auckland, the region’s public health agency, failed its duty of care to the woman and was in breach of the code of patient rights.⁠\n⁠\nThe patient initially had a C-section due to pregnancy complications and her “elevated maternal body mass.”⁠\n⁠\nFollowing the procedure, doctors and medical staff completed a routine count of all their surgical instruments, but the AWR was not included, as is standard.⁠\n⁠\nA nurse told the health commission no one in their department has ever included an AWR in the tool count because “the Alexis Retractor doesn’t go into the wound completely.” The unnamed nurse said only “half of the retractor needs to remain outside the patient and so it would not be at risk of being retained.”⁠\n⁠\nAccording to the report, the surgery theatre staff who were present during the patient’s C-section “are genuinely concerned and were most apologetic upon hearing of the woman’s experience.”⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Sandra Mu/Getty Images","created_time":1694205922,"high_res_url":"https://image-cdn.later.com/t/linkinbio/1f8c6a4ebf8768-LIB37721742.jpg?width=960&t=1694205922&sig=d3053a7745745d955810e627229cc1c31fe7840eceadb89420dcad9f4a053dc3","image_url":"https://image-cdn.later.com/linkinbio/1f8c6a4ebf8768-LIB37721742.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/1f8c6a4ebf8768-LIB37721742.jpg?width=320&height=320&t=1694205922&sig=1e7a6a041f32a704385a966de7195baaed90a4427afe6dec6366790e38782f87","link_url":"https://globalnews.ca/news/9941728/medical-tool-found-womans-body-surgery-error-new-zealand/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37721742&utm_medium=social&utm_source=linkin.bio","media_id":"17972529473358217","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/1f8c6a4ebf8768-LIB37721742.jpg?width=240&height=240&t=1694205922&sig=f8edf0ce2e7bc2f6538ad552ed69e1bf5ae4516c65b8ed83700120c1ba02f50d","network_type":"instagram","post_id":308277281,"post_type":"feed","posted_time":1694282432,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37716654,"caption":"A gender reveal party in Mexico ended in tragedy after a pilot crashed as he flew over the heads of partygoers.⁠\n⁠\nA video of the incident circulating online shows the red Cessna-type plane flying close to the ground as it approaches a couple waiting in front of a sign that reads “Oh baby.”⁠\n⁠\nThe plane releases plumes of pink smoke before the left wing appears to break off from the main body of the aircraft, sending it spinning as it careens to the left. The footage quickly snaps back to the couple who are embracing as confetti cannons go off.⁠\n⁠\nAccording to local news site El Sol de Sinaloa, the pilot crashed in farmland behind the country estate where the gender reveal party was taking place Saturday evening. He was seriously injured on impact.⁠\n⁠\nParamedics from the Sinaloa Red Cross treated the pilot at the scene before taking him to a hospital, but authorities told CNN the pilot later died from his injuries.⁠\n⁠\nThe pilot was identified as 32-year-old Luis Ángel by El Sol de Sinaloa. Investigators are looking into what may have caused the crash.⁠\n⁠\nNo other injuries were reported due to the accident.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Screengrab","created_time":1694193516,"high_res_url":"https://image-cdn.later.com/t/linkinbio/131d6ca86f4ff7-LIB37716654.jpg?width=960&t=1694193516&sig=ec44436a8e553654619cacf691b8374128d2fd7eb79a16eaa02d788909af2065","image_url":"https://image-cdn.later.com/linkinbio/131d6ca86f4ff7-LIB37716654.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/131d6ca86f4ff7-LIB37716654.jpg?width=320&height=320&t=1694193516&sig=b7e32501f5a9f696f5359d210717431f0d0bd544a2d4e48f72de06e4c9c94297","link_url":"https://globalnews.ca/news/9938818/gender-reveal-party-mexico-plane-crash-pilot-dead/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37716654&utm_medium=social&utm_source=linkin.bio","media_id":"18008221681791101","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/131d6ca86f4ff7-LIB37716654.jpg?width=240&height=240&t=1694193516&sig=6f8544f111026792a0dfe0b432875f3f4b14a5ac8f41180223889a1f157f9938","network_type":"instagram","post_id":308250995,"post_type":"feed","posted_time":1694193621,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37711728,"caption":"Amber, the German Shepherd who was rescued from abuse in August, was adopted on Sept. 7.⁠\n⁠\nPolice said officers responded to reports of a man actively abusing a dog while walking in Inglewood at around 7:40 p.m. on Aug. 15. According to an Aug. 19 news release, a witness confronted the suspect about his behaviour towards the animal. Police said the suspect allegedly threatened the witness.⁠\n⁠\nOn Aug. 17, police said they received a tip and officers were able to identify the suspect. Officers then started a joint investigation with the CHS’ protection and investigations department.⁠\n⁠\nPolice said the dog is owned by the Alberta Rescue Foundation (ARF) and was being fostered by the alleged suspect at the time of the incident. ARF immediately removed the dog from his care.⁠\n⁠\nNow, she is being adopted by the man who reported the abuse.⁠\n⁠\n“She’ll be a fantastic dog for walks along the river and through the Inglewood neighbourhood,” said Dennis Sorensen, Amber’s new owner.⁠\n⁠\nSorensen said he is grateful for the support from Calgarians after news of the alleged abuse broke. A lot of Calgarians reached out to Sorenson to help get Amber back into ARF’s care.⁠\n⁠\n“I don’t think we could have asked for a better ending.”⁠\n⁠\nClick the link in the @globalnews bio to read more.⁠\n⁠\n📸: ARF","created_time":1694184331,"high_res_url":"https://image-cdn.later.com/t/linkinbio/130f31db494e1e-LIB37711728.jpg?width=960&t=1694184331&sig=495cfe012af2770d92bdeb063afe64a4fdca0dc560279b88af67c8d7b9065d6d","image_url":"https://image-cdn.later.com/linkinbio/130f31db494e1e-LIB37711728.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/130f31db494e1e-LIB37711728.jpg?width=320&height=320&t=1694184331&sig=a5ef722c79f3c99c2679c31d6834d5dba5e05e4945577c0e962bb9bb1ee430b7","link_url":"https://globalnews.ca/news/9943227/abused-dog-adoption-calgary/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37711728&utm_medium=social&utm_source=linkin.bio","media_id":"17949831536668038","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/130f31db494e1e-LIB37711728.jpg?width=240&height=240&t=1694184331&sig=bdb7ba5190942698142364e3997de91143044a45de0bf33d3bc2ee96b1cd8e49","network_type":"instagram","post_id":308228324,"post_type":"feed","posted_time":1694184439,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37689845,"caption":"Police in Bali are investigating a fatal accident at a high-end resort after an outdoor elevator failed and plummeted into a ravine, killing five people.⁠\n⁠\nThe accident occurred at the Ayuterra Resort in Ubud, a town in the uplands of Bali known for its valleys and terraced rice fields.⁠\n⁠\nVideo of the incident circulated online showing five people entering the glass elevator, which runs on an inclined track like a funicular. The elevator starts to slowly ascend and moves out of frame until, seconds later, it reappears, racing down the track at a high speed.⁠\n⁠\nThe elevators shoots out at the end of the track and falls into the ravine below.⁠\n⁠\nAll five people who died were young hotel workers. Their deaths have sparked uproar among local activists who are calling on the tourism industry to prioritize the health and safety of their employees, the Bali Sun reports.⁠\n⁠\nTwo of the workers died at the scene and the other three died after being rushed to a hospital.⁠\n⁠\nThe elevator that catastrophically failed was designed to bring staff and guests from the upper levels of the hotel to the resort facilities on a lower level. The glass elevator is known for being an “Instagrammable experience at the hotel,” the Bali Sun reports.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Getty","created_time":1694109794,"high_res_url":"https://image-cdn.later.com/t/linkinbio/5d9d486d276fd4-LIB37689845.jpg?width=960&t=1694109794&sig=8010071475a4b1b0920991367cefa643bbfc0fe5c4502e5d4c914da7da767c16","image_url":"https://image-cdn.later.com/linkinbio/5d9d486d276fd4-LIB37689845.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/5d9d486d276fd4-LIB37689845.jpg?width=320&height=320&t=1694109794&sig=6cbd6b3575139f692fd02e27485709caf82f58fc8eca75077a16364eee77c6ec","link_url":"https://globalnews.ca/news/9941789/bali-elevator-ravine-resort-accident/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37689845&utm_medium=social&utm_source=linkin.bio","media_id":"17970125618409863","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/5d9d486d276fd4-LIB37689845.jpg?width=240&height=240&t=1694109794&sig=bb6138a4c39f298406d1d74e19974e58d4d19f5c9257e46bf92223c04bebe6f8","network_type":"instagram","post_id":308126747,"post_type":"feed","posted_time":1694109854,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37631462,"caption":"Air Canada has apologized to customers who were allegedly escorted off a plane for refusing to sit in a chair covered with vomit for the duration of their over four-hour flight.⁠\n⁠\nThe airline issued a statement after a viral Facebook post claimed two as-yet unidentified female flyers were told there was nothing to be done about the visible vomit on their soiled seats.⁠\n⁠\nSusan Benson, a passenger onboard the Aug. 26 flight from Las Vegas to Montreal, said she first noticed the smell of vomit — and two women struggling to be seated — when she boarded the plane.⁠\n⁠\n“There was a bit of a foul smell but we didn’t know at first what the problem was. Apparently, on the previous flight someone had vomited in that area,” Benson wrote. “Air Canada attempted a quick cleanup before boarding but clearly wasn’t able to do a thorough clean. They placed coffee grinds in the seat pouch and sprayed perfume to mask the smell.”⁠\n⁠\nBenson claimed when the “clearly upset” passengers spoke to the flight attendant about the visible vomit on their seats, the staff member was apologetic, but informed them there was nothing that could be done.⁠\n⁠\nAfter a supervisor reiterated that they would have to sit in the soiled seats, the two women were “reluctantly” provided blankets, wipes and vomit bags to clean the area themselves, according to Benson.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: AaronP/Bauer-Griffin/GC Images","created_time":1693931734,"high_res_url":"https://image-cdn.later.com/t/linkinbio/46b1de40723c70-LIB37631462.jpg?width=960&t=1693931734&sig=4da8a66f9e785497b014a2992f2ffdd144a5eb1bc4db30ad7fdfcaab10681040","image_url":"https://image-cdn.later.com/linkinbio/46b1de40723c70-LIB37631462.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/46b1de40723c70-LIB37631462.jpg?width=320&height=320&t=1693931734&sig=60d4f0cbaf78f0c9f67ee5e0b0a45fcf6ce600c7ce55788442b5ac97ed69f5da","link_url":"https://globalnews.ca/news/9938774/air-canada-vomit-seat-passenger-apology/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37631462&utm_medium=social&utm_source=linkin.bio","media_id":"17990183777078015","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/46b1de40723c70-LIB37631462.jpg?width=240&height=240&t=1693931734&sig=8c83df77a6f7adfb9ab52df5e89784f257922deeaca5bebb0b68b3621ea25fae","network_type":"instagram","post_id":307826971,"post_type":"feed","posted_time":1693931777,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37585161,"caption":"It’s officially a party (in the back) for Tami Manis, a Tennessee woman who just captured the Guinness World Record for longest female mullet.⁠\n⁠\nManis, 58, last cut the hair on the back of her head on Feb. 9, 1990. In that time, it’s grown to a staggering five feet, eight inches in length.⁠\n⁠\n“A lot of people just notice it when I turn around, so most of the time it’s like they don’t realize how long my hair is until they look at the backside,” Manis said in a video posted by Guinness World Records this week.⁠\n⁠\nManis, a public health nurse from Knoxville, says she has to keep her she-mullet braided most of the time, as her hair is longer than she is tall. After a once-weekly wash, a friend will help her braid it and she keeps it plaited until the next time it’s due for cleaning.⁠\n⁠\nShe says she takes care of her long locks with Hask hair products, and when she’s done shampooing and conditioning it she uses paper towels to help it dry.⁠\n⁠\nAccording to Guinness, Manis competed in the “Femullet” division of the 2022 U.S. Mullet Championships and finished in second place, coming just behind competitor Alexa Lindsey of Michigan and taking home a $300 prize.⁠\n⁠\nAlthough the mullet, known for its business-in-the-front, party-in-the-back versatility, has been sported throughout history, it’s most often associated with the 1980s and 1990s, when it was popularized by celebrities like Billy Ray Cyrus, Patrick Swayze and a variety of hair metal bands.⁠\n⁠\nManis said she, too, had a mullet in the 1980s and felt immediate pangs of regret when she cut it off in 1989. She went back for one last trim to the back of her head in 1990 and since then she hasn’t stopped it from growing.⁠\n⁠\nShe told Guinness her extraordinary hairstyle is now one of her most defining traits — when she encounters someone she hasn’t seen for years, they often remember her based on her mullet alone.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Courtesy / Guinness World Records","created_time":1693703263,"high_res_url":"https://image-cdn.later.com/t/linkinbio/729b0696bf5aa2-LIB37585161.jpg?width=960&t=1693703263&sig=c98fb030db580e9312a22d2ce7c1353ad63a1753b740032d6a779b967d90d2f5","image_url":"https://image-cdn.later.com/linkinbio/729b0696bf5aa2-LIB37585161.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/729b0696bf5aa2-LIB37585161.jpg?width=320&height=320&t=1693703263&sig=6708a7234e6e9a01e0e94c916acb5683cc043a32bd5f540ecb9f1c0749ec26ca","link_url":"https://globalnews.ca/news/9934335/guinness-world-record-longest-female-mullet-tami-manis/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37585161&utm_medium=social&utm_source=linkin.bio","media_id":"17990657684067583","media_type":"carousel","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/729b0696bf5aa2-LIB37585161.jpg?width=240&height=240&t=1693703263&sig=20c3abf28a146bfba464f522675a407bd68a409dd9df67f5bb89235555601211","network_type":"instagram","post_id":307574621,"post_type":"feed","posted_time":1693753237,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37548434,"caption":"If you were among the thousands of disappointed Taylor Swift fans across Canada that didn’t get a presale code to one of her highly anticipated Eras Tour shows in Toronto — fear not — there’s another way to see Swift perform her career-spanning, 44-song setlist.⁠\n⁠\nSwift announced on social media Thursday that she is bringing her Eras Tour to the silver screen with a concert film running in theatres across North America.⁠\n⁠\n“The Eras Tour has been the most meaningful, electric experience of my life so far and I’m overjoyed to tell you that it’ll be coming to the big screen soon,” Swift wrote.⁠\n⁠\nOver 150 Cineplex locations in Canada will screen the film on Thursday, Fridays, Saturdays and Sundays, according to a press release, meaning that Swift fans across the country can enjoy the Eras Tour much closer to home — and without having to shell out for expensive tickets and travel arrangements.⁠\n⁠\nThe first screenings will start on Oct 13 and the run time for the movie clocks in at two hours and 45 minutes.⁠\n⁠\nTickets for the concert film cost a (comparatively) affordable $19.89 for adults — a nod to her album 1989, no doubt — and $13.13 for children under 13 and seniors over 65. They are available for purchase now on the Cineplex.com website.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Kevin Winter/TAS23/Getty Images for TAS Rights Management","created_time":1693519432,"high_res_url":"https://image-cdn.later.com/t/linkinbio/f33eb03469d575-LIB37548434.jpg?width=960&t=1693519432&sig=421eade1962e0c85919f7a6e67940f2d09c0d2e374e69d962e80c547b865b478","image_url":"https://image-cdn.later.com/linkinbio/f33eb03469d575-LIB37548434.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/f33eb03469d575-LIB37548434.jpg?width=320&height=320&t=1693519432&sig=0288ef99d695ea6f5e4dc69b4825acebfcbade173c0e7d704143b8a342eda5aa","link_url":"https://globalnews.ca/news/9931301/taylor-swift-eras-tour-movie-cineplex/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37548434&utm_medium=social&utm_source=linkin.bio","media_id":"17982038321382518","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/f33eb03469d575-LIB37548434.jpg?width=240&height=240&t=1693519432&sig=c109245fc28d094046bb9c45e1846d2012a473b721334bff44a230a623715f0a","network_type":"instagram","post_id":307377495,"post_type":"feed","posted_time":1693522833,"social_profile_id":3553390,"linkinbio_post_links":[]},{"id":37540301,"caption":"There are alligators and then there are alligators.⁠\n⁠\nHunters in Mississippi have broken a record for the longest alligator ever captured and killed in the state, taking out a gigantic creature that measured more than 14 feet long – or about 4.3 metres.⁠\n⁠\nThe alligator, captured over the weekend by four hunters during the state’s hunting season, is about the size of a small SUV.⁠\n⁠\n“He measured 14 feet and 3 inches long, with belly girth of 66 inches and tail girth of 46.5 inches,” officials wrote on Facebook. “He weighed 802.5 lbs!”⁠\n⁠\nThe enormous, scaly creature was hauled out of the Yazoo River by Don Woods, Tanner White, Will Thomas and Joey Clark — all experienced hunters. (In other words, don’t try this at home.)⁠\n⁠\nDespite being seasoned experts at hunting gators, Woods told the Mississippi Clarion-Ledger that their crew fought with the monster for at least seven hours straight before pulling it into their boat.⁠\n⁠\n“He dictated everything we did. It was exhausting, but your adrenaline is going so you don’t notice it. It was more mentally exhausting than anything because he kept getting off,” Woods told the outlet, adding that their crew lost a lot of their reels and rods in the fight.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Facebook / Chris Mann","created_time":1693500382,"high_res_url":"https://image-cdn.later.com/t/linkinbio/1026fa768df68b-LIB37540301.jpg?width=960&t=1693500382&sig=7b41f36e63c6caa89628a5e6a94e4e59afb51e57ef96af02cef1ed8807d61689","image_url":"https://image-cdn.later.com/linkinbio/1026fa768df68b-LIB37540301.jpg","instagram_profile_id":3553390,"large_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/1026fa768df68b-LIB37540301.jpg?width=320&height=320&t=1693500382&sig=20541c3e3df942b53728dd5a8c1303cf08665f23ff8e346deb36cbde710c06d8","link_url":"https://globalnews.ca/news/9926464/alligator-caught-record-breaking-mississippi-hunters/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37540301&utm_medium=social&utm_source=linkin.bio","media_id":"17969308433399366","media_type":"image","med_thumbnail_url":"https://image-cdn.later.com/t/linkinbio/1026fa768df68b-LIB37540301.jpg?width=240&height=240&t=1693500382&sig=fd6093564da49197c85e791ab710a59a4dc888cb6d64463300e8bb5c35675ca7","network_type":"instagram","post_id":307331999,"post_type":"feed","posted_time":1693500491,"social_profile_id":3553390,"linkinbio_post_links":[]}],"linkinbio_page_id":37292}