{
    "linkinbio_posts": [
        {
            "id": 37426512,
            "caption": "In a medical first for the U.K., surgeons in Oxford have successfully performed a womb transplant between two sisters. The complicated procedure is a form of fertility treatment expected to usher in a new era of child birthing possibilities.⁠\n⁠\nThe oldest sister, 40, is a living donor who had already birthed two children. She donated the organ to her 34-year-old sister, who was born with an undeveloped womb. The sisters, who are English, wished to remain anonymous.⁠\n⁠\nDetails of the surgery were published on Tuesday in the British Journal of Obstetrics and Gynaecology (BJOG). The surgeries were performed by a team at Churchill Hospital in Oxford in early 2023 as part of the U.K. living donor program.⁠\n⁠\nThe transplant implantation took more than nine hours to complete. Altogether, the operations on both sisters totalled around 17 hours and involved more than 30 staff members. Both women were well enough to leave the hospital after 10 days in care.⁠\n⁠\nThe sister who received the womb is “incredibly happy” and “over the moon” about the successful treatment, according to the charity Womb Transplant U.K., which paid for the procedure.⁠\n⁠\nThe recipient plans to use in vitro fertilization (IVF) in an attempt to have two children of her own.⁠\n⁠\nBefore the transplant, the sister who received the womb underwent several fertility treatments, including stimulation to generate eggs and intracytoplasmic sperm injection (ICSI) to produce embryos. The embryo transfer is expected to take place later this year, barring any complications.⁠\n⁠\nResearchers have worked for the last 25 years to develop the womb transplant procedure, according to the NHS.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Womb Transplant U.K.",
            "created_time": 1693053590,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/e5cc34ed71db5e-LIB37426512.jpg?width=960&t=1693053590&sig=e839fa46ccbd8f978e7543e4429be108edd60e2993d9367ef2c8be6247b8360d",
            "image_url": "https://image-cdn.later.com/linkinbio/e5cc34ed71db5e-LIB37426512.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/e5cc34ed71db5e-LIB37426512.jpg?width=320&height=320&t=1693053590&sig=4499801b96e80edcbc1c2dd6445e160555ff0ce20de68ec2714c32aed4ee180d",
            "link_url": "https://globalnews.ca/news/9914053/woman-receives-sisters-womb-first-ever-u-k-transplant/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37426512&utm_medium=social&utm_source=linkin.bio",
            "media_id": "17845914045048538",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/e5cc34ed71db5e-LIB37426512.jpg?width=240&height=240&t=1693053590&sig=b68b1f1336f4f90ac75dc138ac1083453e0239307f1866c803939f5e42c8eda3",
            "network_type": "instagram",
            "post_id": 306751146,
            "post_type": "feed",
            "posted_time": 1693062047,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37421063,
            "caption": "A 43-year-old man was arrested Thursday and charged with stalking after police said they were notified he was going door to door looking for Drew Barrymore’s house.⁠\n⁠\nThe incident comes just three days after Barrymore was escorted off stage during an event at the 92nd Street Y in New York City, when an audience member approached her and shouted, “You know who I am! I need to see you at some point while you’re in New York,” according to videos shared on social media.⁠\n⁠\nPolice in Southampton Town, just outside Manhattan, reported that they arrested Chad Michael Busto for misdemeanour stalking on Thursday afternoon.⁠\n⁠\nThe arrest came a day after police received a 911 call about a suspicious person who was “riding a bicycle up into private driveways and stating to area residents that he was looking for Drew Barrymore’s residence,” Lt. Todd Spencer wrote in a press release.⁠\n⁠\nSouthampton police have yet to officially confirm if Busto is the same man who rushed Barrymore at Monday’s event. Spencer wrote in an email to Global News: “It is believe(d) that he is the same person.”⁠\n⁠\nAccording to videos of Monday’s interaction between Barrymore and the audience member, the man identifies himself as “Chad Michael Busto” as he rushes to the stage.⁠\n⁠\nBusto was located by police on Wednesday as he was allegedly scouring Southampton for Barrymore, but was released after a “brief detainment for questioning,” Lt. Spencer wrote.⁠\n⁠\nPatrol officers notified detectives about the incident and a follow-up investigation was conducted.⁠\n⁠\n“Their investigation led to facts that substantiated a charge for Stalking and a wanted flyer was distributed to neighboring agencies,” police said, adding that investigators became aware of “previous incidents” between Busto and Barrymore.⁠\n⁠\nOn Thursday afternoon, East Hampton Town Police located Busto, took him into custody and turned him over to Southampton police. Busto was held in jail overnight and was arraigned Friday morning.⁠\n⁠\nBarrymore has yet to comment publicly on Busto’s arrest.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: ANGELA WEISS/AFP via Getty Images",
            "created_time": 1692999833,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/ed4d946a08c369-LIB37421063.jpg?width=960&t=1692999833&sig=d91b0b664ed1725e33b777b7269fe1eaa0edb2c55643a63576d1fc08aa907dcd",
            "image_url": "https://image-cdn.later.com/linkinbio/ed4d946a08c369-LIB37421063.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/ed4d946a08c369-LIB37421063.jpg?width=320&height=320&t=1692999833&sig=572c4ef47c9dfc3fde22b0438f3f5e88017dbd37e9b3d20d3c4c474d27c3c549",
            "link_url": "https://globalnews.ca/news/9919937/drew-barrymore-stalking-arrest-chad-michael-busto/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37421063&utm_medium=social&utm_source=linkin.bio",
            "media_id": "17995447769304539",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/ed4d946a08c369-LIB37421063.jpg?width=240&height=240&t=1692999833&sig=98362f59363c326cecc03a8de803a07b16ddcb10b7cf9f5a23e1bc80b183f243",
            "network_type": "instagram",
            "post_id": 306725725,
            "post_type": "feed",
            "posted_time": 1692999914,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37410752,
            "caption": "A glacier in Austria that has seen unprecedented melting in recent years has given up the body of a man believed to have died while skiing over 20 years ago.⁠\n⁠\nA mountain guide found the remains of the man high up in the Austrian Alps on the Schlatenkees glacier, police said. The remains had clearly been there for some time, they added.⁠\n⁠\nThe guide called police in Lienz who were able to retrieve the body with a helicopter. The glacier is located in the Hohe Tauern national park in eastern Tyrol province, near the Italian border. The body was found at an altitude of about 2,900 metres.⁠\n⁠\nA few metres below the body, rescuers discovered a backpack containing cash, a bank card and a driving licence. The man also had ski touring equipment with him. It’s believed he died in an accident on the glacier.⁠\n⁠\nPolice have tentatively identified the remains as belonging to an Austrian man who was 37 at the time. Authorities believe he died in 2001, meaning the man may have been encased in ice for 22 years.⁠\n⁠\nDNA testing is being carried out to officially confirm the man’s identity, but those results are not expected for another few weeks, police said.⁠\n⁠\nThis discovery comes on the heels of other human remains that were found on the same glacier less than two months ago, AFP reported.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Martin Zwick/Universal Images Group via Getty Images",
            "created_time": 1692975634,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/1c656aeeb6a11e-LIB37410752.jpg?width=960&t=1692975634&sig=9dbb5feabdf44e670d1f0922eb8ae0191026d345aac95ef4b7e6d8f50213c14d",
            "image_url": "https://image-cdn.later.com/linkinbio/1c656aeeb6a11e-LIB37410752.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/1c656aeeb6a11e-LIB37410752.jpg?width=320&height=320&t=1692975634&sig=d36a638a1752ed40d3a3dfab33c2b7e148caeec3ef855063cd0b2c599251e928",
            "link_url": "https://globalnews.ca/news/9914082/dead-body-found-austria-glacier-melting/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37410752&utm_medium=social&utm_source=linkin.bio",
            "media_id": "17985761528131272",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/1c656aeeb6a11e-LIB37410752.jpg?width=240&height=240&t=1692975634&sig=9a8119677f469ea23cde9d7421b71021b1c48990afcaeb25cf51fa968f74be8d",
            "network_type": "instagram",
            "post_id": 306676150,
            "post_type": "feed",
            "posted_time": 1692975731,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37394272,
            "caption": "As the Maui wildfires blazed through the town of Lahaina, Hawaii this month, the inferno created a trail of destruction and devastation, but it stopped short of one single home.⁠\n⁠\nIn a breathtaking photo, the lone, 100-year-old wooden house on Front Street is seen unscathed alongside numerous other properties that have been turned to ash and rubble.⁠\n⁠\nThe photo has already achieved viral status on social media, with many calling the red-roofed residence a “miracle house.”⁠\n⁠\nHomeowners Trip Millikin and Dora Atwater Millikin told the local outlet Honolulu Civil Beat they purchased the property in 2021.⁠\n⁠\nThe couple was in Massachusetts as wildfires began on Aug. 8. They assumed their home would be lost.⁠\n⁠\nWhen a friend later showed the Millikins’ a photo of their house standing alone after the fire, surrounded by other not-so-lucky properties, their feelings were complicated.⁠\n⁠\n“It looks like it was photoshopped in,” Trip told the Civil Beat. “We started crying. I felt guilty. We still feel guilty.”⁠\n⁠\nThe only visible damage the fire seemed to cause to their home was a few scorched patches of grass and bubbling paint on one wall, the Civil Beat reported.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Patrick T. Fallon / AFP via Getty Images",
            "created_time": 1692913937,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/f3fc10d28b16a0-LIB37394272.jpg?width=960&t=1692913937&sig=8e2acaad160e14ccef6d3e332ac8973cb33447d209abf0f5916693082c58c75b",
            "image_url": "https://image-cdn.later.com/linkinbio/f3fc10d28b16a0-LIB37394272.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/f3fc10d28b16a0-LIB37394272.jpg?width=320&height=320&t=1692913937&sig=7e16068d770fdb605b89691754ae642758e9dd70c147d61b9825c9c6d13629c6",
            "link_url": "https://globalnews.ca/news/9914601/100-year-old-miracle-house-in-lahaina-survives-deadly-maui-fire/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37394272&utm_medium=social&utm_source=linkin.bio",
            "media_id": "17969487203384582",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/f3fc10d28b16a0-LIB37394272.jpg?width=240&height=240&t=1692913937&sig=30bcb4096b2cf655a40c4a0e9950e9aac733918664e01e001cf78c6230e5d20a",
            "network_type": "instagram",
            "post_id": 306603832,
            "post_type": "feed",
            "posted_time": 1692914057,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37365831,
            "caption": "Public health authorities in Washington state say they have pinned down the origin of a listeria outbreak that led to six hospitalizations and the deaths of three people: contaminated milkshakes.⁠\n⁠\nInvestigators with the Washington State Department of Health found listeria bacteria in “all milkshake flavors” sold at a Frugals brand restaurant in Tacoma. The culprit behind the contamination were two ice cream machines that hadn’t been cleaned properly.⁠\n⁠\nTwo of the people who were hospitalized with listeria reported that they had consumed milkshakes at the Frugals burger restaurant prior to falling ill.⁠\n⁠\nHealth authorities said that milkshakes and ice cream had caused listeria outbreaks in the past, so health inspectors collected milkshake samples on Aug. 8 for testing. ⁠\n⁠\nA week later, genetic fingerprinting of the bacteria in the milkshakes showed it was the same strain of listeria that caused the outbreak.⁠\n⁠\nThe six victims were all hospitalized between Feb. 27 and July 22, but health officials are still warning the public to contact their doctors if they consumed milkshakes at the Tacoma Frugals location during the summer, since listeria infections can take up to 70 days to present symptoms.⁠\n⁠\nNo other Frugals locations are believed to be affected in the listeria outbreak.⁠\n⁠\nThe restaurant discontinued the use of its two ice cream machines on Aug. 8 and they will be kept out of service until the the Tacoma-Pierce County Health Department determines they are free of listeria contamination.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Jeffery Coolidge/Getty Images",
            "created_time": 1692822412,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/cf266467265073-LIB37365831.jpg?width=960&t=1692822412&sig=0e532dfafbd12d8939cabd67a29d0a1190bf1d5e74716769285a2659249462b4",
            "image_url": "https://image-cdn.later.com/linkinbio/cf266467265073-LIB37365831.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/cf266467265073-LIB37365831.jpg?width=320&height=320&t=1692822412&sig=2565182222f5a14ea21131ea8b510595ec6af2dd6454d457c187426fb26dcc77",
            "link_url": "https://globalnews.ca/news/9914492/listeria-milkshakes-contaminated-tacoma-washington/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37365831&utm_medium=social&utm_source=linkin.bio",
            "media_id": "17956924166645125",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/cf266467265073-LIB37365831.jpg?width=240&height=240&t=1692822412&sig=9210490b6e4bf226008262059133b06ac2321db33473bbdb6204baeba2baba0c",
            "network_type": "instagram",
            "post_id": 306467927,
            "post_type": "feed",
            "posted_time": 1692822493,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37361169,
            "caption": "Singers Ariana Grande and Demi Lovato have parted ways with high-profile music manager Scooter Braun, according to numerous reports.⁠\n⁠\nBillboard reported that both Lovato, 31, and Grande, 30, have severed ties with the music mogul, though the reasoning for the split remains unclear. Entertainment Weekly also confirmed reports of the business breakup.⁠\n⁠\nGrande signed with Braun’s entertainment group SB Projects in 2013. That same year, she released her debut album Yours Truly. It is not clear when exactly Grande reportedly ended the professional relationship with Braun, 42.⁠\n⁠\nFor her part, Lovato signed with Braun and SB Projects in 2019. Billboard reported that the Skyscraper singer parted ways with Braun in July. Lovato does not have new management, but the outlet reported that “conversations” with prospective parties are already taking place. Reports maintained that the split between Lovato and Braun was amicable.⁠\n⁠\nLovato and Grande have not commented publicly on the situation.⁠\n⁠\nOn social media, Braun appeared to poke fun at the reports and on Tuesday tweeted, “Breaking news… I’m no longer managing myself.”⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Steve Granitz/WireImage & Matt Winkelmeyer/Getty Image ",
            "created_time": 1692811190,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/b1dfea1779e6eb-LIB37361169.jpg?width=960&t=1692811190&sig=d87ad800823d92aacb03e27753b88780cb38140bb2aa06c20aef39df1dda76c0",
            "image_url": "https://image-cdn.later.com/linkinbio/b1dfea1779e6eb-LIB37361169.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/b1dfea1779e6eb-LIB37361169.jpg?width=320&height=320&t=1692811190&sig=955cb06f57537ce3b47237f493cb67b931202638758e78f18183937df1e25051",
            "link_url": "https://globalnews.ca/news/9911466/ariana-grande-demi-lovato-split-manager-scooter-braun/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37361169&utm_medium=social&utm_source=linkin.bio",
            "media_id": "17970851426347983",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/b1dfea1779e6eb-LIB37361169.jpg?width=240&height=240&t=1692811190&sig=968d9f3a14a634a401c61769b8cde2f5a499375e23ac402f57554c7c8392d92c",
            "network_type": "instagram",
            "post_id": 306444154,
            "post_type": "feed",
            "posted_time": 1692811220,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37330831,
            "caption": "A storeowner in California was killed Friday after a dispute over an LGBTQ2 Pride flag displayed outside her shop spiralled into deadly violence, police said. Online tributes have poured in to honour the late businesswoman, who was a beloved figure in her local community.⁠\n⁠\nA man shot and killed 66-year-old Laura Ann Carleton right in front of her clothing store in Cedar Glen, a small community in the San Bernadino Mountains, east of Los Angeles.⁠\n⁠\nThe man “made several disparaging remarks about a rainbow flag that stood outside the store before shooting Carleton,” according to a statement from the San Bernadino County Sheriff’s Department.⁠\n⁠\nCarleton was pronounced dead by medical personnel outside Mag.Pi, the clothing store she owned and operated.⁠\n⁠\nThe man fled the scene on foot after the shooting Friday afternoon, but police eventually located him and he was killed in a confrontation with officers. He was still armed with a handgun when police attempted to contact him.⁠\n⁠\nFurther details about the unnamed man, and the “lethal force encounter” that left him dead, were not released by police.⁠\n⁠\nCarleton, who went by the name “Lauri,” was the mother of a blended family of nine children, according to her biography on the Mag.Pi website. She is also survived by her husband of 28 years.⁠\n⁠\nAn LGBTQ2 advocacy group in nearby Lake Arrowhead is helping to organize a vigil in Carleton’s honour. In an Instagram post, the organization wrote that Carleton didn’t identify as a member of the LGBTQ2 community, “but spent her time helping (and) advocating for everyone in the community.”⁠\n⁠\nThe group characterized Carleton’s slaying as a hate crime, as she was defending her Pride flags when she was killed — though police have not said if Carleton’s death is considered as such.⁠\n⁠\nIn a followup post, the group shared a photo of the outside of Mag.Pi, which has been flooded with flower bouquets in the wake of Carleton’s death.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Facebook/Mountain Provisions Cooperative",
            "created_time": 1692719706,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/f1e810a116ef71-LIB37330831.jpg?width=960&t=1692719706&sig=c32c81e9c2db638a07dc37ce03d9acd865107013fea684bc9c8b9c149074289e",
            "image_url": "https://image-cdn.later.com/linkinbio/f1e810a116ef71-LIB37330831.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/f1e810a116ef71-LIB37330831.jpg?width=320&height=320&t=1692719706&sig=8dfd518b4c5eacb11194fa23a25c1ba84535d5718e930176d392de2ceefa760a",
            "link_url": "https://globalnews.ca/news/9909527/storeowner-killed-pride-flag-display-california-lauri-carleton/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37330831&utm_medium=social&utm_source=linkin.bio",
            "media_id": "17994218966175880",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/f1e810a116ef71-LIB37330831.jpg?width=240&height=240&t=1692719706&sig=c8e2cfe40d20d6ac1c4a6a7e3225b698526dd18d41a9ae43be1441586ff817d2",
            "network_type": "instagram",
            "post_id": 306303632,
            "post_type": "feed",
            "posted_time": 1692719776,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37307117,
            "caption": "Olga Carmona made history Sunday when she scored the game-winning goal that secured Spain’s first Women’s World Cup title. But the 23-year-old’s incredible accomplishment may always be tinged with grief after she learned, after the match, that her father had died.⁠\n⁠\nThe Royal Spanish Football Federation announced the death of Carmona’s father on Sunday, writing that she “learned the sad news after the World Cup final.”⁠\n⁠\n“We send our most sincere hugs to Olga and her family in a moment of deep pain,” the federation stated. “We love you, Olga, you are the history of Spanish football.”⁠\n⁠\nCarmona scored the only goal of the FIFA Women’s World Cup final on Sunday between Spain and England. She made the game-winning goal about 29 minutes into play, giving Spain an early lead that it was able to defend until time expired. In the regular season, Carmona plays for Real Madrid.⁠\n⁠\nCarmona wrote a tribute to her father on social media Sunday alongside a photo of her kissing the World Cup gold medal.⁠\n⁠\nDetails about Carmona’s father’s death have not been officially released, but a spokesperson for the Royal Spanish Football Federation told Reuters that he had been fighting a long illness and died on Friday, two days before the final.⁠\n⁠\nAccording to Spanish media outlet Relevo, Carmona’s family and friends decided not to tell her so that she could focus on the most important match of her life.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Patricia Pérez Ferraro/SOPA Images/LightRocket via Getty Images",
            "created_time": 1692639308,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/06c73952c96a0b-LIB37307117.jpg?width=960&t=1692639308&sig=5dec339d244aaedfce9121e9d6a61764d616121d93cde45cccda2103b426649c",
            "image_url": "https://image-cdn.later.com/linkinbio/06c73952c96a0b-LIB37307117.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/06c73952c96a0b-LIB37307117.jpg?width=320&height=320&t=1692639308&sig=0de7adc9dea79a597fbe721dfdf9b88d4de405548cb2d30ac0bc6eb344f3e9b1",
            "link_url": "https://globalnews.ca/news/9909192/olga-carmona-world-cup-father-dead/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37307117&utm_medium=social&utm_source=linkin.bio",
            "media_id": "18023425603577095",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/06c73952c96a0b-LIB37307117.jpg?width=240&height=240&t=1692639308&sig=09fbc77797e13efd333e0dca0260ccc3508c4d22b7e8bc2fde9352e1e78d5b95",
            "network_type": "instagram",
            "post_id": 306179347,
            "post_type": "feed",
            "posted_time": 1692639499,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37268918,
            "caption": "Some of Ikea‘s cellular blinds are being recalled by Health Canada over concerns of potential choking hazards for children due to small parts contained in the product.⁠\n⁠\nIn a recall notice issued on Monday, Health Canada advises anyone who bought Ikea’s Trippevals or Hoppvals cellular blinds between May 1, 2021 and Sept. 5, 2022 to immediately stop using them and contact the Swedish furniture maker for a refund, with no proof of purchase necessary.⁠\n⁠\n“The design of the product does not properly address the hazards of small parts which can present a choking hazard to young children,” Health Canada said in a statement posted in its recall notice.⁠\n⁠\nThere are eight sizes of Hoppvals blinds in three separate colours — white, grey and blue — and 11 sizes of the Trippevals product in light grey and white that are being recalled. The specific serial numbers can be found on Health Canada’s recall notice.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImages: Health Canada⁠\n",
            "created_time": 1692389275,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/90c75708502a0c-LIB37268918.jpg?width=960&t=1692389275&sig=b5ec64880a7a4413a547d925e3453b145dd51cd884b63b5cf303f56b0e525753",
            "image_url": "https://image-cdn.later.com/linkinbio/90c75708502a0c-LIB37268918.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/90c75708502a0c-LIB37268918.jpg?width=320&height=320&t=1692389275&sig=26df008050a4c388bd72f4af77b3d34594422d5449f0a171a4274c4c0c4bed3d",
            "link_url": "https://globalnews.ca/news/9897665/ikea-recall-cellular-blinds-choking-hazard/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37268918&utm_medium=social&utm_source=linkin.bio",
            "media_id": "17993032508153494",
            "media_type": "carousel",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/90c75708502a0c-LIB37268918.jpg?width=240&height=240&t=1692389275&sig=b3949ccf3b4dbd06899a40599c3118d623e5ef65868dbdc1e421aff571544cb8",
            "network_type": "instagram",
            "post_id": 305983544,
            "post_type": "feed",
            "posted_time": 1692389413,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37264825,
            "caption": "A social media account representing Lizzo‘s current dance troupe has voiced support for the singer after several of her former backup dancers filed a lawsuit this month alleging workplace misconduct.⁠\n⁠\nIn an Instagram post, Lizzo’s backup dancers, called the “Big Grrrls,” said they were “so honored to share the stage with such amazing talent” during the 35-year-old singer’s Special Tour, which ended in July.⁠\n⁠\n“The commitment to character and culture taking precedence over every movement and moment has been one of the Greatest lessons and Blessings that we could possibly ask for,” the statement reads. “THANK YOU to Lizzo for shattering limitations and kicking in the door way for the Big Grrrl & Big Boiii Dancers to do what we love!”⁠\n⁠\n“You have created a platform where we have been able to parallel our Passion with purpose!” the troupe continued. “Not only for Us, but for Women and All people breaking Barriers.”⁠\n⁠\nA montage of video footage from Lizzo’s tour accompanied the post. In the clips, the Big Grrrls dance troupe is seen on stage and behind the scenes as they perform dance routines, prepare hair and makeup and pose for photos.⁠\n⁠\nIt is not clear who penned the statement on behalf of the dancers.⁠\n⁠\nThe defence for the About Damn Time singer comes just over two weeks after three former dancers — Arianna Davis, Crystal Williams and Noelle Rodriguez — sued Lizzo for various forms of misconduct.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Tim Mosenfelder/Getty Images⁠\n",
            "created_time": 1692378740,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/fcede5e4ba40d1-LIB37264825.jpg?width=960&t=1692378740&sig=35262760c8823f0b6e7e21e5a10a5654e454f6652f280d901a1244cba0984e9e",
            "image_url": "https://image-cdn.later.com/linkinbio/fcede5e4ba40d1-LIB37264825.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/fcede5e4ba40d1-LIB37264825.jpg?width=320&height=320&t=1692378740&sig=a978b0dcead32e89690902e42c24c5ffd979feb7ed1335a037da8da65864a721",
            "link_url": "https://globalnews.ca/news/9904706/lizzo-dancers-big-grrrls-support-lawsuit/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37264825&utm_medium=social&utm_source=linkin.bio",
            "media_id": "18278243428148581",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/fcede5e4ba40d1-LIB37264825.jpg?width=240&height=240&t=1692378740&sig=d4094a47fe08d8a4677f13c14d7d85c8787f81d7de799f1f1a64bd29bbeedd72",
            "network_type": "instagram",
            "post_id": 305963488,
            "post_type": "feed",
            "posted_time": 1692378852,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37237763,
            "caption": "Sam Asghari, the husband of pop star Britney Spears, has filed for divorce after 14 months of marriage, according to numerous reports.⁠\n⁠\nRumours of the couple’s allegedly tumultuous relationship have circulated online since they wed in June 2022. The Associated Press reported that a knowledgeable source said Asghari, 29, filed for divorce on Wednesday.⁠\n⁠\nTMZ was the first outlet to break the story, though People magazine has also since reported news of the separation. The AP reported that court records in Los Angeles and Ventura counties did not show where the divorce had been filed.⁠\n⁠\nBoth Spears, 41, and Asghari have not commented publicly.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Jon Kopaloff/FilmMagic",
            "created_time": 1692289681,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/b8bd70c3b54d3c-LIB37237763.jpg?width=960&t=1692289681&sig=29fafc398f9d76b9ed9ee4291bf5581c8bd8cb4a760dc8f9f368cd7cdf3f4e15",
            "image_url": "https://image-cdn.later.com/linkinbio/b8bd70c3b54d3c-LIB37237763.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/b8bd70c3b54d3c-LIB37237763.jpg?width=320&height=320&t=1692289681&sig=781da910db2f391087a57bb0c228324eaaa49b78da705cbfc9553c6732acaa30",
            "link_url": "https://globalnews.ca/news/9901985/britney-spears-divorce-husband-sam-asghari/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37237763&utm_medium=social&utm_source=linkin.bio",
            "media_id": "17968082594386150",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/b8bd70c3b54d3c-LIB37237763.jpg?width=240&height=240&t=1692289681&sig=8900c33272163a953c006b0359c12fc7914c844959464da7b14ad8a1d99bb9b5",
            "network_type": "instagram",
            "post_id": 305836077,
            "post_type": "feed",
            "posted_time": 1692289824,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37219697,
            "caption": "Hyundai Motors North America has issued a safety recall of 63,128 cars in Canada and the United States.⁠\n⁠\nOf those recalled vehicles, 11,120 are in Canada, Jennifer McCarthy, a spokesperson for the company, told Global News Wednesday.⁠\n⁠\nThe vehicles are being recalled as a safety measure due to an issue with the transmission electric oil pump for the Idle Stop & Go System (ISG), which poses a potential fire risk.⁠\n⁠\nThe model year 2023-24 Hyundai Palisade vehicles and model year 2023 Tucson, Sonata, Elantra and Kona vehicles produced for sale in the U.S. and Canada have been affected by the recall.⁠\n⁠\nMcCarthy said owners can continue to drive the affected vehicles, but they are being advised to park these cars outside and away from structures until the recall remedy is completed.⁠\n⁠\nShe added that owners of the recalled vehicles will be notified by mail with instructions to bring their vehicles to a Hyundai dealer to inspect and replace the electric oil pump controller if required. ⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: THE CANADIAN PRESS/Doug Ives",
            "created_time": 1692222969,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/def4f751cf0862-LIB37219697.jpg?width=960&t=1692222969&sig=f4f40140fd4d1a019841bea055e6da2c9961af73ad280b0739076aaf1f7e4153",
            "image_url": "https://image-cdn.later.com/linkinbio/def4f751cf0862-LIB37219697.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/def4f751cf0862-LIB37219697.jpg?width=320&height=320&t=1692222969&sig=c0494e25068915220b0ccf7f82e760e90206a6224649438f32d0a75e14c5f4e2",
            "link_url": "https://globalnews.ca/news/9899750/hyundai-recall-canada-us-cars/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37219697&utm_medium=social&utm_source=linkin.bio",
            "media_id": "17906633633811192",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/def4f751cf0862-LIB37219697.jpg?width=240&height=240&t=1692222969&sig=fcc57fecb3232ab0b282a70ebc1a919561f832aded5ad9056f7b70fce5992faf",
            "network_type": "instagram",
            "post_id": 305749562,
            "post_type": "feed",
            "posted_time": 1692223251,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37218656,
            "caption": "Sean and Leigh Anne Tuohy have spoken out against claims that they tricked former NFL tackle Michael Oher into a conservatorship instead of adopting him, and made millions off his name while he received nothing.⁠\n⁠\nOher accused the Tuohy family of this, and more, in a suit filed Monday seeking to terminate the conservatorship.⁠\n⁠\nIn a statement from the Tuohy family lawyer, obtained by The Associated Press, the Tuohys called the lawsuit “hurtful and absurd” and said it was part of a “shakedown” attempt by Oher, 37, whose life story inspired the book and movie The Blind Side.⁠\n⁠\nLawyer Martin Singer claims that Oher attempted to extract money from the Tuohy family in the past when he threatened to plant a negative story about them in the press if the Tuohys didn’t pay him US$15 million (just over C$20 million).⁠\n⁠\nThe statement goes on to say that the idea that the Tuohys sought to profit off Oher is “not only offensive, it is transparently ridiculous.” The statement notes the Tuohys are worth “hundreds of millions of dollars” and had no need to “withhold a few thousand dollars.”⁠\n⁠\nSinger said the Tuohys hope Oher regrets his recent decisions and that they can reconcile.⁠\n⁠\nThe Tuohys, however, do not deny that they have a conservatorship over Oher, though they insist they only set it up to help him with health insurance, a driver’s licence and being admitted to college. The statement says the Tuohys will not oppose Oher’s wish to end their conservatorship.⁠\n⁠\nIn an interview with the Daily Memphian, Sean Tuohy said he was “devastated” by the lawsuit but still loves Oher, nonetheless.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Getty Images/CP Images",
            "created_time": 1692219590,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/9b0373a93da04e-LIB37218656.jpg?width=960&t=1692219590&sig=cc8b11ec658398d010b4e1c9a076cc2f78064650371a498ce960de115482e26d",
            "image_url": "https://image-cdn.later.com/linkinbio/9b0373a93da04e-LIB37218656.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/9b0373a93da04e-LIB37218656.jpg?width=320&height=320&t=1692219590&sig=886f35bac9391bcdce3467752d1bab7ca9f7e1bbbba68805d67221a22e3cfd08",
            "link_url": "https://globalnews.ca/news/9899453/michael-oher-blind-side-family-tuohys-shakedown-adoption-lawsuit/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37218656&utm_medium=social&utm_source=linkin.bio",
            "media_id": "18001288249956133",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/9b0373a93da04e-LIB37218656.jpg?width=240&height=240&t=1692219590&sig=c4f4eedf4c71596f47e6280dfe7488a0ebe6d000ab921be11ed972fabeb1f36d",
            "network_type": "instagram",
            "post_id": 305743848,
            "post_type": "feed",
            "posted_time": 1692219648,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37162918,
            "caption": "A bucket-list trip to the Grand Canyon turned nightmarish when a 13-year-old boy from North Dakota survived an over 70-foot (over 21-metre) fall from a cliff on Tuesday.⁠\n⁠\nWyatt Kauffman told the local Phoenix television station 12 News he lost his balance at the Grand Canyon’s North Rim. He said he had moved along the steep, narrow path to avoid being captured in another tourist’s photo.⁠\n⁠\nThe National Park Service said Kauffman fell between 70 and 100 feet (about 21 to 30 metres) below Bright Angel Point, where he’d been standing. Wyatt, who was travelling with his mother, said he was holding onto a rock for balance with just one hand before he slipped.⁠\n⁠\n“It wasn’t that good of a grip. It was kind of pushing me back. I lost my grip and started to fall back,” he said. “After the fall, I don’t remember anything.”⁠\n⁠\nThe Grand Canyon National Park’s Search and Rescue (SAR) team executed a mission to save Wyatt. It took about 40 rescuers nearly two hours to find and rescue the teen, as the SAR team had to use ropes and a basket to raise him back to the North Rim.⁠\n⁠\nWyatt was airlifted to a hospital in Las Vegas. 12 News reported the plunge left the teen with nine broken vertebrae, a ruptured spleen, a collapsed lung, a concussion, a broken hand and a dislocated finger. He is in stable condition and was reportedly released from hospital Saturday.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Robert Evans & Stephen Yelverton via Getty Images",
            "created_time": 1692040074,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/dce897ac863281-LIB37162918.jpg?width=960&t=1692040074&sig=7d0e4f8dd116802621cee46c5933f96dd73938081bf3c5bd7fa44e7aa39199cb",
            "image_url": "https://image-cdn.later.com/linkinbio/dce897ac863281-LIB37162918.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/dce897ac863281-LIB37162918.jpg?width=320&height=320&t=1692040074&sig=00eca1f85c36ac5590137865f5a49cc750de11fe8fea99ac4a0e0a03050b09e6",
            "link_url": "https://globalnews.ca/news/9894869/grand-canyon-teen-survives-fall-wyatt-kauffman/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37162918&utm_medium=social&utm_source=linkin.bio",
            "media_id": "17972784578324273",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/dce897ac863281-LIB37162918.jpg?width=240&height=240&t=1692040074&sig=2627609b979fef3dcf556afd1db8737df8cacd3055b89a574d85445ddd8f85ef",
            "network_type": "instagram",
            "post_id": 305461185,
            "post_type": "feed",
            "posted_time": 1692040092,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37155388,
            "caption": "An international team of researchers has unearthed an early human skull unlike any other in the fossil record — and their analysis suggests we may have to add another branch to the evolutionary tree.⁠\n⁠\nThe ancient skull, which consists of a nearly complete jaw and partial cranium, was found in Hualongdong, a region in east China near the Yangtze River. It dates back 300,000 years, which also happens to be the age of the oldest-known skull of a modern human, or homo sapiens.⁠\n⁠\nBut this skull does not belong to the homo sapiens species. It shares a striking resemblance to modern humans in some aspects, including a flat face, but lacks what researchers call a “true chin,” suggesting that the skull could be from an earlier human species such as homo erectus.⁠\n⁠\nThe scientists write that the face of the skull “seems to exhibit more derived modern human-like features,” while the jaw and top of the head “seem to reflect more primitive traits.”⁠\n⁠\nUpon further analysis, the researchers found that the skull exhibits a “mosaic” of features found in homo sapiens, homo erectus and the Denisovans, another early human species that is evolutionarily close to Neanderthals.⁠\n⁠\nAfter trying to definitively classify the bones under one of these known species, the researchers have been left wondering if the Hualongdong skull, abbreviated as HLD 6, could potentially represent a new species of early human, a missing link in the evolutionary chain.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n",
            "created_time": 1692024938,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/d925404efdc8a8-LIB37155388.jpg?width=960&t=1692024938&sig=00875e4d021ff7cbe299a0f6f1ca6730448987699a22f74e93019eb74c736458",
            "image_url": "https://image-cdn.later.com/linkinbio/d925404efdc8a8-LIB37155388.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/d925404efdc8a8-LIB37155388.jpg?width=320&height=320&t=1692024938&sig=e8a34390128e66ba4a60a46f036c8a75e5db0e1a8af8e5f9da2a176807edd0a4",
            "link_url": "https://globalnews.ca/news/9887674/skull-china-early-human-species/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37155388&utm_medium=social&utm_source=linkin.bio",
            "media_id": "17998435130011438",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/d925404efdc8a8-LIB37155388.jpg?width=240&height=240&t=1692024938&sig=32939b3c00ff2ce9c6aaf659029d15641b2712e165155547a156838ed922a7fa",
            "network_type": "instagram",
            "post_id": 305420536,
            "post_type": "feed",
            "posted_time": 1692024974,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37118138,
            "caption": "Google says it may start to delete accounts that have not been accessed for at least two years by Dec. 1, 2023.⁠\n⁠\nThe policy will apply to accounts for all of its products, including YouTube and Gmail. The company justified the move as a security measure, to prevent breaches of the old accounts.⁠\n⁠\n“Keeping you safe means having strong privacy practices across our products that minimize how long we store your personal files and any data associated with them,” Google said in a recent message to Gmail account holders.⁠\n⁠\n“We want to protect your private information and prevent any unauthorized access to your account even if you’re no longer using our services.”⁠\n⁠\nIn order to avoid an account deletion, Google says all you have to do is sign into the account and it will no longer be considered inactive. Just remember to sign into it again within two years so it won’t be deleted.⁠\n⁠\nGoogle said it will send several reminder emails if you have an account eligible for deletion. After the account is deleted, the Gmail address cannot be used again when creating a new account.⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Getty",
            "created_time": 1691773324,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/2818b58b479c96-LIB37118138.jpg?width=960&t=1691773324&sig=f72b386219026b58cad58b88051a6359ace5816e8af058ddc516a8dfb6def028",
            "image_url": "https://image-cdn.later.com/linkinbio/2818b58b479c96-LIB37118138.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/2818b58b479c96-LIB37118138.jpg?width=320&height=320&t=1691773324&sig=31fe54d84f7e8b632022896f12a5cce38544ec8a4cb4c97590f3a3a93355bdcd",
            "link_url": "https://globalnews.ca/news/9885196/google-inactive-account-delete-gmail/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37118138&utm_medium=social&utm_source=linkin.bio",
            "media_id": "18001049047963630",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/2818b58b479c96-LIB37118138.jpg?width=240&height=240&t=1691773324&sig=86c4e15d8dde5b299d9ab87fd317fe5c277904e96a5b50be11829f0a03578bce",
            "network_type": "instagram",
            "post_id": 305227065,
            "post_type": "feed",
            "posted_time": 1691773517,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37097029,
            "caption": "Taylor Swift is continuing to fulfil her fans’ Wildest Dreams — this time with an announcement that a re-release of her album 1989 is on the way.⁠\n⁠\nOn Wednesday, during her final performance at California’s SoFi Stadium as part of her Eras Tour, Swift announced she would be releasing the highly anticipated 1989 (Taylor’s Version).⁠\n⁠\nThe re-recorded album will be released on Oct. 27, the same date 1989 was originally released in 2014. The new album will include five previously unreleased tracks.⁠\n⁠\nSwift, 33, made the announcement during the surprise song portion of her show, a fan-favourite segment that sees the Grammy-winning singer perform two numbers not previously included in her setlist.⁠\n⁠\nSwift told her screaming fans that she wanted to share something she’s been planning for a long time.⁠\n⁠\n“I think instead of just telling you about it, I think I’ll just sort of show you,” Swift said as she revealed the new album art for 1989 (Taylor’s Version). ⁠\n⁠\nClick the link in the @GlobalNews bio to read more.⁠\n⁠\nImage: Kevin Winter/TAS23/Getty Images for TAS Rights Management",
            "created_time": 1691699402,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/8b9d103086786f-LIB37097029.jpg?width=960&t=1691699402&sig=62d71a4c6039407b307892c447b6578a27d9cc19917143dd554d9011b08c7e6b",
            "image_url": "https://image-cdn.later.com/linkinbio/8b9d103086786f-LIB37097029.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/8b9d103086786f-LIB37097029.jpg?width=320&height=320&t=1691699402&sig=16250ab623372b46e9207bcf481ce3a2f268afa7d51a5799fc7452cae7f04ca7",
            "link_url": "https://globalnews.ca/news/9887685/taylor-swift-1989-taylors-version-release/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37097029&utm_medium=social&utm_source=linkin.bio",
            "media_id": "17906839184743152",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/8b9d103086786f-LIB37097029.jpg?width=240&height=240&t=1691699402&sig=b5717f9dd7b513894f62ee7c3a1c7c5edef7a5265af30274c981bccc2be8a461",
            "network_type": "instagram",
            "post_id": 305126998,
            "post_type": "feed",
            "posted_time": 1691699600,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        },
        {
            "id": 37096484,
            "caption": "You can read our award-winning reporting and watch our 24/7 streaming channel by typing our URL (www.globalnews.ca) into your browser’s address bar. ⁠\n⁠\nYou can also bookmark Globalnews.ca to give yourself an easy, one-click solution to connecting with us.⁠\n⁠\nAnd you can find our latest reporting on several social media platforms:⁠\n⁠\nX (formerly Twitter)⁠\nReddit⁠\nTelegram⁠\nLinkedIn⁠\nYouTube⁠\nTikTok⁠\nApple News (swipe left on your homescreen on your Apple device)⁠\n⁠\nGet curated headlines daily in your email inbox with our daily and breaking news newsletters. Get the latest weekly personal finance and health news with our weekly newsletters, Money 123 and Health IQ.⁠\n⁠\nWatch our streaming channels on the Global TV app (on Google Play and Apple).⁠\n⁠\nYou can also watch Global News on Amazon Prime, Samsung, LG smart TVs, Roku, Pluto TV, Android TV, and Fire TV.⁠\n",
            "created_time": 1691698003,
            "high_res_url": "https://image-cdn.later.com/t/linkinbio/e2dbd066be96a4-LIB37096484.jpg?width=960&t=1691698003&sig=21797c213a795360d4d9fd7154211e8b5b8db85fdcccdc0a26f83f992e5d34ac",
            "image_url": "https://image-cdn.later.com/linkinbio/e2dbd066be96a4-LIB37096484.jpg",
            "instagram_profile_id": 3553390,
            "large_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/e2dbd066be96a4-LIB37096484.jpg?width=320&height=320&t=1691698003&sig=ba545e0af44af2869f4afabab946e48fc2476458eb2814cc8ff671854688ef72",
            "link_url": "https://globalnews.ca/news/9885400/how-you-can-find-global-news/?utm_campaign=later-linkinbio-globalnews&utm_content=later-37096484&utm_medium=social&utm_source=linkin.bio",
            "media_id": "18011020297833272",
            "media_type": "image",
            "med_thumbnail_url": "https://image-cdn.later.com/t/linkinbio/e2dbd066be96a4-LIB37096484.jpg?width=240&height=240&t=1691698003&sig=90d0bd344a0d90d1cbb5df219036011702eec5b83a823ff6ee6f8d585eebbeef",
            "network_type": "instagram",
            "post_id": 305124130,
            "post_type": "feed",
            "posted_time": 1691698216,
            "social_profile_id": 3553390,
            "linkinbio_post_links": []
        }
    ],
    "linkinbio_page_id": 37292
}